
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтаФорма = ПараметрыВыполненияКоманды.Источник;
	
	Попытка
		Если НЕ ЭтаФорма.ВключенИерархическийПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанныеДерева = ЭтаФорма.Элементы.Дерево.ТекущиеДанные;
		Если ТекущиеДанныеДерева = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		РодительскаяСтрока = ТекущиеДанныеДерева.ПолучитьРодителя();
		Если РодительскаяСтрока <> Неопределено Тогда
			ЭтаФорма.Элементы.Дерево.ТекущаяСтрока = РодительскаяСтрока.ПолучитьИдентификатор();
			ЭтаФорма.Элементы.Список.ТекущаяСтрока = ТекущиеДанныеДерева.Ссылка;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти