
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресСКД) Тогда
		СКД = ПолучитьИзВременногоХранилища(Параметры.АдресСКД);
		Если ТипЗнч(СКД) = ТИп("СхемаКомпоновкиДанных") Тогда
			Для каждого НаборДанных из СКД.НаборыДанных Цикл
				Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
					НовСтр = ТаблицаНаборов.Добавить();
					НовСтр.НаборДанных = НаборДанных.Имя;
					НовСтр.ТекстЗапроса = НаборДанных.Запрос;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Показатель = Параметры.Показатель;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНаборовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаНаборов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекстЗапроса = ТекущиеДанные.ТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти