
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #229, Карпов Д.Ю. , 13.09.2023
	НовыйЭлемент = Элементы.Добавить("проф_ДокументОснование", Тип("ПолеФормы"), Элементы.ШапкаПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.проф_ДокументОснование";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Гиперссылка = Истина;
	Если ЗначениеЗаполнено(Объект.проф_ДокументОснование) Тогда
		Элементы.Шапка.ТолькоПросмотр = Истина;
		Элементы.Страницы.ТолькоПросмотр = Истина;
		Элементы.КомментарийИОтветственный.ТолькоПросмотр = Истина;
		//++ Проф-ИТ, #229, Горетовская М.С., 22.09.2023 - Автом. создания в ТОиР док.
		// "Резервирование на внутренние заказы" на основании док. "Перемещение", созданного в ERP
		Элементы.ТоварыПодобратьТовары.Доступность = Ложь;
		//-- Проф-ИТ, #229, Горетовская М.С., 22.09.2023 - Автом. создания в ТОиР док.
		// "Резервирование на внутренние заказы" на основании док. "Перемещение", созданного в ERP
	КонецЕсли;
	//-- Проф-ИТ, #229, Карпов Д.Ю. , 13.09.2023
	
	//++ Проф-ИТ, #294, Соловьев А.А., 24.10.2023
	ЭлементНазначениеИсходное = Элементы.Добавить("ТоварыНазначениеИсходное", Тип("ПолеФормы"), Элементы.Товары);
	ЭлементНазначениеИсходное.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементНазначениеИсходное.Заголовок = НСтр("ru = 'Назначение исходное'");
	ЭлементНазначениеИсходное.ПутьКДанным = "Объект.Товары.проф_НазначениеИсходное";
	
	ЭлементНазначение = Элементы.Добавить("ТоварыНазначение", Тип("ПолеФормы"), Элементы.Товары);
	ЭлементНазначение.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементНазначение.Заголовок = НСтр("ru = 'Назначение'");
	ЭлементНазначение.ПутьКДанным = "Объект.Товары.проф_Назначение";
	
	Элементы.Переместить(ЭлементНазначениеИсходное, Элементы.Товары, Элементы.ТоварыКоличествоУпаковок);
	Элементы.Переместить(ЭлементНазначение,			Элементы.Товары, Элементы.ТоварыКоличествоУпаковок);
	//-- Проф-ИТ, #294, Соловьев А.А., 24.10.2023
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	проф_ОбщегоНазначенияВызовСервера.УстановитьПараметрВыбораПодразделения(Элементы);
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

#КонецОбласти