#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Фамилия        = Параметры.Фамилия;
	Имя            = Параметры.Имя;
	Отчество       = Параметры.Отчество;
	ФизическоеЛицо = Параметры.ФизическоеЛицо;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество, Период");
	СтруктураФИО.Фамилия  = Фамилия;
	СтруктураФИО.Имя      = Имя;
	СтруктураФИО.Отчество = Отчество;
	
	ОповеститьОВыборе(СтруктураФИО);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти