
#Область ПрограммныйИнтерфейс

// Устанавливает свойство Наименование объекту Сотрудник.
// Параметры:
//		Фамилия - Строка - фамилия, 
//		Имя - Строка - Имя, 
//		Отчество - Строка - отчество,
//		УточнениеНаименованияФизЛица - Строка - строка, дополняющая имя физ. лица.
//		УточнениеНаименованияСотрудника - Строка - строка, дополняющая имя сотрудника.
// Возвращаемое значение:
//		Строка - полное наименование сотрудника.
Функция ПолноеНаименованиеСотрудника(Фамилия, Имя, Отчество, УточнениеНаименованияФизЛица, УточнениеНаименованияСотрудника = "") Экспорт
	
	ПолноеНаименование = Фамилия;
	
	Если ЗначениеЗаполнено(Имя) Тогда
		ПолноеНаименование = ПолноеНаименование + " " + Имя;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчество) Тогда
		ПолноеНаименование = ПолноеНаименование + " " + Отчество;
	КонецЕсли;
	Если ЗначениеЗаполнено(УточнениеНаименованияФизЛица) Тогда
		ПолноеНаименование = ПолноеНаименование + " " + УточнениеНаименованияФизЛица;
	КонецЕсли;
		
	Возврат ПолноеНаименование;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Рационального числа a/b для b <= 100
// Например, 0,125 = 1/8
// Параметры: 
//  ДесятичноеЧисло - число, представление для которого 
//       необходимо получить 
//  Числитель, Знаменатель - в параметры помещаются числитель и знаменатель дроби
//  Точность - точность переданного десятичного числа. Не обязательный, по умолчанию - 20
// Возвращаемое значение: Истина, если представление получено, Ложь - если не получено.
Функция ПредставлениеРациональногоЧисла(ДесятичноеЧисло, Числитель, Знаменатель, Точность = 20) Экспорт
	
	ПредставлениеНайдено = Ложь;
	Для ЗнаменательРасчетный = 1 По 100 Цикл
		
		ЧислительРасчетный = ДесятичноеЧисло * ЗнаменательРасчетный;
		Если Окр(ЧислительРасчетный, 0) = Окр(ЧислительРасчетный, Точность - 2) Тогда
			ЧислительРасчетный = Окр(ЧислительРасчетный, 0);
			ПредставлениеНайдено = Истина;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ПредставлениеНайдено Тогда
		Числитель = ЧислительРасчетный;
		Знаменатель = ЗнаменательРасчетный;
	КонецЕсли; 
	
	Возврат ПредставлениеНайдено;
		
КонецФункции

Функция ПредставлениеКоличестваСтавок(Знач КоличествоСтавок) Экспорт
	
	ПредставлениеКоличестваСтавок = "";
	
	Если КоличествоСтавок = 1 Тогда
		ПредставлениеКоличестваСтавок = "1";
	Иначе
		
		Если ЗначениеЗаполнено(КоличествоСтавок) Тогда
			
			ЦелаяЧасть = Цел(КоличествоСтавок);
			Если ЦелаяЧасть <> КоличествоСтавок Тогда
				
				Числитель = 1;
				Знаменатель = 1;
				Если ПредставлениеРациональногоЧисла(КоличествоСтавок - ЦелаяЧасть, Числитель, Знаменатель) Тогда
					
					Если Знаменатель > 1 Тогда
						
						ПредставлениеКоличестваСтавок = Строка(Числитель) + "/" + Строка(Знаменатель);
						Если ЦелаяЧасть > 0 Тогда
							ПредставлениеКоличестваСтавок = Строка(ЦелаяЧасть) + " (" + ПредставлениеКоличестваСтавок + ")"
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
	
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеКоличестваСтавок) Тогда
		ПредставлениеКоличестваСтавок = Формат(КоличествоСтавок, "ЧН=");
	КонецЕсли;
	
	Возврат ПредставлениеКоличестваСтавок;
	
КонецФункции

#КонецОбласти
