#Область ОбработчикиСобытий
Процедура ПередУдалением(Отказ)
	
	Если Справочники.Организации.КоличествоОрганизаций() = 1 Тогда 
		Константы.ИспользоватьНесколькоОрганизаций.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Справочники.Организации.КоличествоОрганизаций() > 1 Тогда
		Константы.ИспользоватьНесколькоОрганизаций.Установить(Истина);
	Иначе 
		Константы.ИспользоватьНесколькоОрганизаций.Установить(Ложь);
	КонецЕсли; 	
	
КонецПроцедуры
#КонецОбласти 


