#Область СлужебныеПроцедурыИФункции

Процедура торо_ИнтеграцияСАИСДиспетчерСобытия_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	Если Не ПолучитьФункциональнуюОпцию("торо_ИспользоватьИнтеграциюСАИСДиспетчер") Тогда
	    Возврат;
	КонецЕсли;
	
	Узел = торо_ИнтеграцияСАИСДиспетчер.ПолучитьУзелПланаОбмена();
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	
	ВыгружатьСотрудников = (ТипЗнч(Источник) = Тип("СправочникОбъект.Сотрудники") И Узел.ВыгружатьСотрудников);
	ВыгружатьПодразделения = (ТипЗнч(Источник) = Тип("СправочникОбъект.СтруктураПредприятия") И Узел.ВыгружатьПодразделения);
	ВыгружатьОР = (ТипЗнч(Источник) = Тип("СправочникОбъект.торо_ОбъектыРемонта") И Узел.ВыгружатьОбъектыРемонта И Не Источник.ЭтоГруппа) И Не (ЗначениеЗаполнено(Источник.ТиповойОР) И Не Источник.ТиповойОР.ПередаватьВАИСДиспетчер);
	
	Если ЗначениеЗаполнено(Узел) И (ВыгружатьПодразделения Или ВыгружатьСотрудников Или ВыгружатьОР) Тогда
	    ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("торо_ИнтеграцияСАИСДиспетчер", Источник, Отказ);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти