#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	МультиязычностьСервер.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	Элементы.НормальноеЗначение.Пометка = Ложь;
	Элементы.НедопустимоеЗначение.Пометка = Ложь;
	Элементы.КритическоеЗначение.Пометка = Ложь;

	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		Или (Не Объект.ВыделятьКакНедопустимоеЗначение И Не Объект.ВыделятьКакКритическоеЗначение)Тогда
		Элементы.НормальноеЗначение.Пометка = Истина;
	ИначеЕсли Объект.ВыделятьКакКритическоеЗначение Тогда
		Элементы.КритическоеЗначение.Пометка = Истина;
	ИначеЕсли Объект.ВыделятьКакНедопустимоеЗначение Тогда
		Элементы.НедопустимоеЗначение.Пометка = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МультиязычностьСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МультиязычностьСервер.ПередЗаписьюНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	МультиязычностьСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_Открытие(Элемент, СтандартнаяОбработка)
	МультиязычностьКлиент.ПриОткрытии(ЭтотОбъект, Объект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НормальноеЗначение(Команда)
	Элементы.НормальноеЗначение.Пометка = Истина;
	Элементы.НедопустимоеЗначение.Пометка = Ложь;
	Элементы.КритическоеЗначение.Пометка = Ложь;
	
	Объект.ВыделятьКакКритическоеЗначение = Ложь;
	Объект.ВыделятьКакНедопустимоеЗначение = Ложь;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НедопустимоеЗначение(Команда)
	Элементы.НормальноеЗначение.Пометка = Ложь;
	Элементы.НедопустимоеЗначение.Пометка = Истина;
	Элементы.КритическоеЗначение.Пометка = Ложь;
	
	Объект.ВыделятьКакКритическоеЗначение = Ложь;
	Объект.ВыделятьКакНедопустимоеЗначение = Истина;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КритическоеЗначение(Команда)
	Элементы.НормальноеЗначение.Пометка = Ложь;
	Элементы.НедопустимоеЗначение.Пометка = Ложь;
	Элементы.КритическоеЗначение.Пометка = Истина;
	
	Объект.ВыделятьКакКритическоеЗначение = Истина;
	Объект.ВыделятьКакНедопустимоеЗначение = Ложь;
	
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти