///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений:
//     * Имя           - Строка - имя набора свойств. Формируется из полного имени объекта
//          метаданных заменой символа "." на "_".
//          Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - уникальный идентификатор предопределенного набора свойств.
//          Не должен повторяться в других наборах свойств.
//          Формат идентификатора Random UUID (Version 4).
//          Чтобы получить идентификатор, нужно в режиме 1С:Предприятие вычислить значение
//          конструктора платформы "Новый УникальныйИдентификатор" или воспользоваться online-генератором,
//          например, https://www.uuidgenerator.net/version4.
//     * Используется  - Неопределено
//                     - Булево - признак того, что набор свойств используется.
//          Например, можно использовать для скрытия набора по функциональным опциям.
//          Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
		
КонецПроцедуры

// Получает наименования наборов свойств второго уровня на разных языках.
//
// Параметры:
//  Наименования - Соответствие из КлючИЗначение - представление набора на переданном языке:
//     * Ключ     - Строка - имя набора свойств. Например, "Справочник_Партнеры_Общие".
//     * Значение - Строка - наименование набора для переданного кода языка.
//  КодЯзыка - Строка - код языка. Например, "en".
//
// Пример:
//  Наименования["Справочник_Партнеры_Общие"] = НСтр("ru='Общие'; en='General';", КодЯзыка);
//
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
	
	Наименования["Справочник_ХарактеристикиНоменклатуры_Общие"] = НСтр("ru = 'Общие'", КодЯзыка);
	Наименования["Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие"] = НСтр("ru = 'Общие'", КодЯзыка);
	Наименования["Справочник_торо_ОбъектыРемонта_Общие"] = НСтр("ru = 'Общие'", КодЯзыка);
	Наименования["Справочник_торо_ТиповыеОР_Общие"] = НСтр("ru = 'Общие'", КодЯзыка);
	Наименования["Справочник_Номенклатура_Общие"] = НСтр("ru = 'Общие'", КодЯзыка);
	
КонецПроцедуры

// Заполняет наборы свойств объекта. Обычно требуется, если наборов более одного.
//
// Параметры:
//  Объект       - ЛюбаяСсылка      - ссылка на объект со свойствами.
//               - ФормаКлиентскогоПриложения - форма объекта, к которому подключены свойства.
//               - ДанныеФормыСтруктура - описание объекта, к которому подключены свойства.
//
//  ТипСсылки    - Тип - тип ссылки владельца свойств.
//
//  НаборыСвойств - ТаблицаЗначений:
//     * Набор - СправочникСсылка.НаборыДополнительныхРеквизитовИСведений
//     * ОбщийНабор - Булево - Истина, если набор свойств содержит свойства,
//                             общие для всех объектов.
//    // Далее свойства элемента формы типа ГруппаФормы вида обычная группа
//    // или страница, которая создается, если наборов больше одного без учета
//    // пустого набора, который описывает свойства группы удаленных реквизитов.
//
//    // Если значение Неопределено, значит, использовать значение по умолчанию.
//
//    // Для любой группы управляемой формы.
//     * Высота                   - Число
//     * Заголовок                - Строка
//     * Подсказка                - Строка
//     * РастягиватьПоВертикали   - Булево
//     * РастягиватьПоГоризонтали - Булево
//     * ТолькоПросмотр           - Булево
//     * ЦветТекстаЗаголовка      - Цвет
//     * Ширина                   - Число
//     * ШрифтЗаголовка           - Шрифт
//                    
//    // Для обычной группы и страницы.
//     * Группировка              - ГруппировкаПодчиненныхЭлементовФормы
//
//    // Для обычной группы.
//     * Отображение              - ОтображениеОбычнойГруппы
//
//    // Для страницы.
//     * Картинка                 - Картинка
//     * ОтображатьЗаголовок      - Булево
//
//  СтандартнаяОбработка - Булево - начальное значение Истина. Указывает, получать ли
//                         основной набор, когда НаборыСвойств.Количество() равно нулю.
//
//  КлючНазначения   - Неопределено - (начальное значение) - указывает вычислить
//                      ключ назначения автоматически и добавить к значениям свойств
//                      формы КлючНазначенияИспользования и КлючСохраненияПоложенияОкна,
//                      чтобы изменения формы (настройки, положение и размер) сохранялись
//                      отдельно для разного состава наборов.
//                      Например, для каждого вида номенклатуры - свой состав наборов.
//
//                   - Строка - (не более 32 символа) - использовать указанный ключ
//                      назначения для добавления к значениям свойств формы.
//                      Пустая строка - не изменять свойства ключей формы, т.к. они
//                      устанавливается в форме и уже учитывают различия состава наборов.
//
//                    Добавка имеет формат "КлючНаборовСвойств<КлючНазначения>",
//                    чтобы <КлючНазначения> можно было обновлять без повторной добавки.
//                    При автоматическом вычислении <КлючНазначения> содержит хеш
//                    идентификаторов ссылок упорядоченных наборов свойств.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Знач Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	Если ТипСсылки = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда  	
		ЗаполнитьНаборСвойствДляОр(Объект, ТипСсылки, НаборыСвойств);
	ИначеЕсли  ТипСсылки = Тип("СправочникСсылка.торо_ТиповыеОР") Тогда
		ЗаполнитьНаборСвойствПоВидуНаправленийДляТиповыхОР(Объект, ТипСсылки, НаборыСвойств);
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗаполнитьНаборыСвойствНоменклатуры(Объект, ТипСсылки, НаборыСвойств);
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		ЗаполнитьНаборыСвойствХарактеристикНоменклатуры(Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли; 
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ХарактеристикиНоменклатуры", "3c4fecd8-5623-11e5-b304-938744e1f0ce", Истина);
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ХарактеристикиНоменклатуры_Общие", "3c4feceb-5623-11e5-b304-938744e1f0ce",, "3c4fecd8-5623-11e5-b304-938744e1f0ce");
	
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_НаправленияОбъектовРемонтныхРабот", "df287267-0875-11e6-bbf2-c86000550c9e", Истина);
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие", "3c4fecea-5623-11e5-b304-938744e1f0ce",, "df287267-0875-11e6-bbf2-c86000550c9e");

	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ОбъектыРемонта", "716cb58a-b28d-11e4-be63-f46d045fd415", Истина);
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ОбъектыРемонта_Общие", "716cb58b-b28d-11e4-be63-f46d045fd415",, "716cb58a-b28d-11e4-be63-f46d045fd415");

	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ТиповыеОР", "716cb58c-b28d-11e4-be63-f46d045fd415", Истина);
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ТиповыеОР_Общие", "716cb58d-b28d-11e4-be63-f46d045fd415",, "716cb58c-b28d-11e4-be63-f46d045fd415");

	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Номенклатура", "3c4fecf5-5623-11e5-b304-938744e1f0ce", Истина);
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Номенклатура_Общие", "3c4fecd6-5623-11e5-b304-938744e1f0ce",, "3c4fecf5-5623-11e5-b304-938744e1f0ce");
			
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_АктОВыполненииРегламентногоМероприятия", "465fa430-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_АктОВыполненииЭтапаРабот", "3c4fecdb-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_АктПриемкиОборудования", "465fa442-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_АнализКоренныхПричин", "f1c4900a-9c35-11eb-9c1b-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ВводНачальныхДанных", "465fa43f-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ВнешнееОснованиеДляРабот", "3c4fecda-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ВнутреннееПотреблениеТоваров", "3c4fece9-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ВозвратТоваровНаСклад", "78e34cb9-45c9-11eb-8515-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ВыбытиеОбъектаРемонта", "465fa42f-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ВыявленныеДефекты", "3c4fece0-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ГрафикРегламентныхМероприятийТОиР", "6062e3e6-c13e-11e6-9e54-c86000550c9e");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ЗаказНаВнутреннееПотребление", "3c4fecd3-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ЗаказПоставщику", "78e34cba-45c9-11eb-8515-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ЗакрытиеЗаказаНаВнутреннееПотребление", "78e34cbb-45c9-11eb-8515-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ЗакрытиеЗаявокИРемонтов", "465fa441-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_КомиссионноеРассмотрение", "465fa433-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ЗаявкаНаРемонт", "3c4fecf2-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ИзменениеПоложенияВСтруктуреИерархии", "465fa431-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ИзменениеСоставаРемонтнойБригады", "465fa444-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_Инвентаризация", "78e34cbe-45c9-11eb-8515-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_КадровыйПереводСписком", "507a4c63-2767-11ec-9c2a-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_КадровыйПеревод", "6062e3e4-c13e-11e6-9e54-c86000550c9e");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_НарядНаВыполнениеРемонтныхРабот", "3c4fecd2-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_НарядНаРегламентноеМероприятие", "3c4fece1-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_НастройкаРегистрацииНаработкиЗависимыхОР", "465fa435-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ОприходованиеИзлишковТоваров", "3c4fece4-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ОстановочныеРемонты", "465fa43b-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ОценкаРаботыПодрядчика", "465fa43c-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ПередачаТоваровНаРуки", "78e34cbc-45c9-11eb-8515-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ПеремещениеТоваров", "3c4feccc-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ПланГрафикРемонта", "3c4fecd7-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ПлановаяДоступностьПерсонала", "525213ea-f436-11eb-9c27-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ПланРаботПодразделения", "aaa7cc60-cfd4-4ddd-a869-b4b072a1b9a1");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ПоступлениеТоваровУслуг", "a521eaaa-210e-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ПриемНаРаботу", "a521eaab-210e-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_ПриемНаРаботуСписком", "507a4c62-2767-11ec-9c2a-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ПринятиеОРКУчету", "465fa439-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_ПрисвоениеКвалификацийСотрудникам", "465fa437-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_РегистрацияЗначенийВнешнихПоказателейKPI", "465fa43d-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_РезервПодВнутреннийЗаказ", "78e34cbd-45c9-11eb-8515-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_СостоянияОбъектовРемонта", "3c4fecee-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_СписаниеНедостачТоваров", "3c4fece2-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_УвольнениеСписком", "507a4c61-2767-11ec-9c2a-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_Увольнение", "465fa42e-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаАналоговНоменклатурыДляРемонтов", "465fa43e-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов", "465fa438-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаКоэффициентовРемонтныхОсобенностей", "465fa443-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы", "465fa440-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаМинимальногоОстаткаНоменклатуры", "465fa432-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаПроизвольногоЗначенияНаработки", "465fa434-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаСтоимостейКвалификаций", "465fa43a-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УстановкаЦелевыхЗначенийПоказателейKPI", "465fa436-2112-11e7-91ff-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_УстановкаЦенНоменклатуры", "3c4fecf4-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УчетКонтролируемыхПоказателей", "3c4feccd-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Документ_торо_УчетНаработкиОборудования", "3c4fecd1-5623-11e5-b304-938744e1f0ce");
	
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ВидыДефектов", "3c4fecf6-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ВидыНоменклатуры", "3c4fecf0-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ВидыРемонтов", "bec3c988-c924-11e7-a1cb-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ВидыЦен", "3c4fecef-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ВидыЭксплуатации", "3c4fecde-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ДоговорыКонтрагентов", "3c4fecdd-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Должности", "3c4fece8-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_Комиссии", "5ffdaf1a-6b2c-4459-98a8-57573c436170");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Контрагенты", "3c4fecf1-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_КритичностьДефекта", "3c4fece3-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Организации", "3c4fecdf-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ПараметрыВыработкиОС", "26d0d606-85c2-11ec-9c33-c86000550ca5");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ПричиныДефектов", "3c4fecdc-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ПричиныПростояОборудования", "3c4fece5-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_РемонтныеБригады", "3c4fecce-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_РесурсыРемонтнойБригады", "3c4feccf-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_СерииНоменклатуры", "6062e3e5-c13e-11e6-9e54-c86000550c9e");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Склады", "3c4fecd4-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_Сотрудники", "3c4fecd5-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_СписокОбъектовРегламентногоМероприятия", "3c4fecec-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_СпособыПланированияРемонтныхРабот", "3c4feccb-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_СтруктураПредприятия", "3c4fece7-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ИдентификаторыТехКарт", "3c4feced-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ТехнологическиеОперации", "3c4fecd9-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_ТиповыеДефектыОборудования", "edc7c436-c40f-11ed-afa1-0242ac120002");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_торо_УсловияВыявленияДефекта", "3c4fecf3-5623-11e5-b304-938744e1f0ce");
	ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, "Справочник_ФизическиеЛица", "716cb598-b28d-11e4-be63-f46d045fd415");	
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
//
// Параметры:
//  Объект                  - СправочникОбъект.РолиИсполнителей - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьНаборСвойствДляОР(торо_ОР, ТипСсылки, НаборыСвойств)
	
	Если торо_ОР.ЭтоГруппа = Ложь Тогда
		Если ЗначениеЗаполнено(торо_ОР.Направление) Тогда	
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие");

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(торо_ОР.Направление, "НаборСвойствОР");
		КонецЕсли;
		
		// Общие реквизиты и сведения типового ОР для ОР будем добавлять если выбран хоть какой то типовой ОР.
		Если ЗначениеЗаполнено(торо_ОР.ТиповойОР) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ТиповыеОР_Общие");
			
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(торо_ОР.ТиповойОР, "НаборСвойствОР");
		КонецЕсли;
		
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ОбъектыРемонта_Общие");
	КонецЕсли;		

КонецПроцедуры

// Получает набор свойств объекта по виду номенклатуры.
Процедура ЗаполнитьНаборСвойствПоВидуНаправленийДляТиповыхОР(ТиповойОР, ТипСсылки, НаборыСвойств)
	
	Если ТиповойОР.ЭтоГруппа = Ложь Тогда	
		Если ЗначениеЗаполнено(ТиповойОР.Направление) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие");
			
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповойОР.Направление, "НаборСвойствОР");
		КонецЕсли;
		
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_торо_ТиповыеОР_Общие");
		
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = ТиповойОР.НаборСвойствОР;
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьНаборыСвойствНоменклатуры(Номенклатура,Типссылки, НаборыСвойств)
	
	Если Не Номенклатура.ЭтоГруппа Тогда
		
		// Реквизиты номенклатуры
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие");
		
		// Реквизиты Вида номенклатуры
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура.ВидНоменклатуры, "НаборСвойств");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаборыСвойствХарактеристикНоменклатуры(Характеристика,Типссылки, НаборыСвойств)
	
	Строка = НаборыСвойств.Добавить();
	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_ХарактеристикиНоменклатуры_Общие");
	
	Если ТипЗнч(Характеристика.Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Характеристика.Владелец, "НаборСвойствХарактеристик");
	ИначеЕсли ТипЗнч(Характеристика.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.НаборСвойствХарактеристик КАК НаборСвойств
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Характеристика.Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ВыборкаДетальныеЗаписи.НаборСвойств;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДобавитьПредопределенныйНабор(Элементы, КодыЯзыков, ИмяНабора, СтрокаУИД, ЭтоГруппа = Ложь, СтрокаУИДРодителя = Неопределено)
	
	ЭтоОбщийНабор = СтрНайти(ИмяНабора, "Общие") > 0;
	
	Если ЭтоОбщийНабор Тогда
		Наименование = "Общие";
	Иначе	
		ПозицияПервойНижнейЧерты = СтрНайти(ИмяНабора, "_");
		ИмяМетаданных = Лев(ИмяНабора, ПозицияПервойНижнейЧерты - 1) + "." + Сред(ИмяНабора, ПозицияПервойНижнейЧерты + 1);  
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяМетаданных);
		
		Наименование = МетаданныеОбъекта.Синоним;
	КонецЕсли;
	
	Наименование = СтрШаблон("ru = '%1'", Наименование);
	
	Набор = Элементы.Добавить();
	Набор.ЭтоГруппа = ЭтоГруппа;
	Если СтрокаУИДРодителя <> Неопределено Тогда
		Набор.Родитель = Новый УникальныйИдентификатор(СтрокаУИДРодителя);	
	КонецЕсли;	
	Набор.ИмяПредопределенногоНабора = ИмяНабора;
	Набор.Используется = Истина;
	Набор.Ссылка = Новый УникальныйИдентификатор(СтрокаУИД); 
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Набор, "Наименование", Наименование, КодыЯзыков);
	
КонецПроцедуры

#КонецОбласти
