
#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ОбновитьСписокДокументов")
Процедура проф_ОбновитьСписокДокументов()
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_АнализКоренныхПричин") Тогда
		МассивИД = Новый Массив();
		МассивИД.Добавить(Документ.ИДРемонта);
		СтруктураМассивID = Новый Структура("МассивID", МассивИД);
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ПлановыеЗатраты") Тогда
		МассивИД = Новый Массив();
		МассивИД.Добавить(Документ.РемонтыОборудования_ID);
		СтруктураМассивID = Новый Структура("МассивID", МассивИД);
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ПроектныеЗатратыНаРемонты") Тогда
		МассивИД = Новый Массив();
		МассивИД.Добавить(Документ.IDРемонта);
		СтруктураМассивID = Новый Структура("МассивID", МассивИД);
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ВводНачальныхДанных") Тогда
		СтруктураМассивID = Новый Структура("МассивID", Новый Массив);
	Иначе
		СтруктураМассивID = торо_ПланированиеРемонтов.ПолучитьМассивIDРемонтов(Документ);
	КонецЕсли; 

	ТаблицаДокументовКО = Новый ТаблицаЗначений;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_АктПриемкиОборудования"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗакрытиеЗаявокИРемонтов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ОстановочныеРемонты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ПланГрафикРемонта"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ПлановыеЗатраты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ПроектныеЗатратыНаРемонты"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_ПланРаботПодразделения"));
	МассивТипов.Добавить(Тип("ДокументСсылка.торо_АнализКоренныхПричин"));
	МассивТипов.Добавить(Тип("БизнесПроцессСсылка.Задание"));
	
	ТаблицаДокументовКО.Колонки.Добавить("Документ", Новый ОписаниеТипов(МассивТипов));
	ТаблицаДокументовКО.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ТаблицаДокументовКО.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументовКО.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов("Булево"));

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка КАК Документ,
	|	КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка.Проведен КАК Проведен,
	|	КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	&Значение КАК Значение
	|ИЗ
	|	КритерийОтбора.торо_СвязанныеДокументыПоРемонту(&Значение) КАК КритерийОтбораСвязанныеДокументыПоРемонту
	|ГДЕ
	|	НЕ КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка ССЫЛКА Документ.торо_ПлановыеЗатраты
	|    И НЕ КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка ССЫЛКА Документ.торо_ПроектныеЗатратыНаРемонты";

	Если ПоказатьСлужебные Тогда
		ПодстрокаПоиска = "НЕ КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка ССЫЛКА Документ.торо_ПлановыеЗатраты
		|    И НЕ КритерийОтбораСвязанныеДокументыПоРемонту.Ссылка ССЫЛКА Документ.торо_ПроектныеЗатратыНаРемонты";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ПодстрокаПоиска, "ИСТИНА"); 
	КонецЕсли;

	Для Каждого ИДРемонта из СтруктураМассивID.МассивID Цикл
		Запрос.УстановитьПараметр("Значение", ИДРемонта);
		РезЗапроса = Запрос.Выполнить();
		Если НЕ РезЗапроса.Пустой() Тогда 
			Выборка = РезЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаДокументовКО.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Документ КАК Документ,
	|	ТаблицаДокументов.Проведен КАК Проведен,
	|	ТаблицаДокументов.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаДокументов.Значение КАК Значение
	|ПОМЕСТИТЬ ДокументыТОИР
	|ИЗ
	|	&Таблица КАК ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыТОИР.Документ КАК Документ,
	|	ДокументыТОИР.Проведен КАК Проведен,
	|	ДокументыТОИР.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументыТОИР.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ДокументыТОИР
	|ИЗ
	|	ДокументыТОИР КАК ДокументыТОИР
	|
	|ОБЪЕДИНИТЬ
	#Вставка //++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|
	|ВЫБРАТЬ
	|	торо_ВнешнееОснованиеДляРабот.ДокументОснование,
	|	торо_ВнешнееОснованиеДляРабот.ДокументОснование.Проведен,
	|	торо_ВнешнееОснованиеДляРабот.ДокументОснование.ПометкаУдаления,
	|	ДокументыТОИР.Значение
	|ИЗ
	|	Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыТОИР КАК ДокументыТОИР 
	|		ПО торо_ВнешнееОснованиеДляРабот.Ссылка = ДокументыТОИР.Документ
	|			И (торо_ВнешнееОснованиеДляРабот.ДокументОснование <> НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	#КонецВставки //-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|
	|ВЫБРАТЬ
	|	торо_ВыявленныеДефектыДокументыОснования.ДокументОснование,
	|	торо_ВыявленныеДефектыДокументыОснования.ДокументОснование.Проведен,
	|	торо_ВыявленныеДефектыДокументыОснования.ДокументОснование.ПометкаУдаления,
	|	""""
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.ДокументыОснования КАК торо_ВыявленныеДефектыДокументыОснования
	|ГДЕ
	|	торо_ВыявленныеДефектыДокументыОснования.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыТОИР.Документ КАК Документ
	|			ИЗ
	|				ДокументыТОИР КАК ДокументыТОИР)
	|	И (торо_ВыявленныеДефектыДокументыОснования.ДокументОснование ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	|    ИЛИ торо_ВыявленныеДефектыДокументыОснования.ДокументОснование ССЫЛКА Документ.торо_УчетКонтролируемыхПоказателей)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ИнтеграцияДокументов.ДокументЕРП КАК Документ,
	|	торо_ИнтеграцияДокументов.ДокументЕРП.Проведен КАК Проведен,
	|	торо_ИнтеграцияДокументов.ДокументЕРП.ПометкаУдаления КАК ПометкаУдаления,
	|	торо_ИнтеграцияДокументов.ДокументТОИР.Ссылка КАК Основание
	|ПОМЕСТИТЬ ДокументыМТО
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ID В(&МассивИД)
	|	И НЕ торо_ИнтеграцияДокументов.ДокументЕРП = НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаказПоставщикуДокументыОснования.Ссылка КАК Документ,
	|	торо_ЗаказПоставщикуДокументыОснования.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	торо_ЗаказПоставщикуДокументыОснования.Ссылка.Проведен КАК Проведен,
	|	торо_ЗаказПоставщикуДокументыОснования.ДокументОснование КАК Основание
	|ПОМЕСТИТЬ ВТ_ДокументыМТО
	|ИЗ
	|	Документ.торо_ЗаказПоставщику.ДокументыОснования КАК торо_ЗаказПоставщикуДокументыОснования
	|ГДЕ
	|	торо_ЗаказПоставщикуДокументыОснования.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ДокументыМТО.Документ
	|			ИЗ
	|				ДокументыМТО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыМТО.Документ,
	|	ДокументыМТО.ПометкаУдаления,
	|	ДокументыМТО.Проведен,
	|	ДокументыМТО.Основание
	|ИЗ
	|	ДокументыМТО КАК ДокументыМТО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ДокументыТОИР.Документ КАК Документ,
	|	ВТ_ДокументыТОИР.Проведен КАК Проведен,
	|	ВТ_ДокументыТОИР.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА НЕ торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДокументИсточник
	|		КОГДА НЕ торо_АктПриемкиОборудованияРемонтыОборудования.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_АктПриемкиОборудованияРемонтыОборудования.ДокументИсточник
	|		КОГДА НЕ торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ДокументОснование ЕСТЬ NULL
	|			ТОГДА торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ДокументОснование
	|		КОГДА НЕ торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка ЕСТЬ NULL
	|			ТОГДА торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Заявка
	|		КОГДА НЕ торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_ЗаявкаНаРемонтРемонтыОборудования.ДокументИсточник
	|		КОГДА НЕ торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник
	|		КОГДА НЕ торо_ОстановочныеРемонты.ДокументОснование ЕСТЬ NULL
	|			ТОГДА торо_ОстановочныеРемонты.ДокументОснование
	|		КОГДА НЕ торо_ОстановочныеРемонтыСвязанныеРемонты.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_ОстановочныеРемонтыСвязанныеРемонты.ДокументИсточник
	|        КОГДА НЕ торо_ПланРаботПодразделенияСписокРемонтовПлана.ДокументОснование ЕСТЬ NULL
	|			ТОГДА торо_ПланРаботПодразделенияСписокРемонтовПлана.ДокументОснование
	|		КОГДА НЕ торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_АктОВыполненииРегламентногоМероприятияМероприятия.ДокументИсточник
	|		КОГДА НЕ торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДокументИсточник ЕСТЬ NULL
	|			ТОГДА торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДокументИсточник
	|		КОГДА НЕ торо_ВыявленныеДефектыДокументыОснования.ДокументОснование ЕСТЬ NULL
	|			ТОГДА торо_ВыявленныеДефектыДокументыОснования.ДокументОснование
	|		КОГДА торо_ПланГрафикРемонтаПланРемонтов.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка)
	|			ТОГДА торо_ПланГрафикРемонтаПланРемонтов.Ссылка.ДокументОснование
	|		КОГДА торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.торо_ВидыОперацийПланаГрафикаППР.Корректировка)
	|			ТОГДА торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка.ДокументОснование
	|		КОГДА НЕ торо_АнализКоренныхПричин.ДокументОснование ЕСТЬ NULL
	|			ТОГДА торо_АнализКоренныхПричин.ДокументОснование
	#Вставка //++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|		КОГДА торо_ВнешнееОснованиеДляРабот.ДокументОснование ЕСТЬ НЕ NULL
	|			ТОГДА торо_ВнешнееОснованиеДляРабот.ДокументОснование
	#КонецВставки //-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|        %Служебные%
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументОснование
	|ПОМЕСТИТЬ ПодготовленныеДанные
	|ИЗ
	|	ВТ_ДокументыТОИР КАК ВТ_ДокументыТОИР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|		ПО ВТ_ДокументыТОИР.Документ = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
	|		ПО ВТ_ДокументыТОИР.Документ = торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_АктПриемкиОборудованияРемонтыОборудования.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеРемонты КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеРемонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|		ПО ВТ_ДокументыТОИР.Документ = торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ОстановочныеРемонты КАК торо_ОстановочныеРемонты
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ОстановочныеРемонты.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ОстановочныеРемонты.IDОсновногоРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ОстановочныеРемонтыСвязанныеРемонты.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПланРаботПодразделения.СписокРемонтовПлана КАК торо_ПланРаботПодразделенияСписокРемонтовПлана
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ПланРаботПодразделенияСписокРемонтовПлана.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ПланРаботПодразделенияСписокРемонтовПлана.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииРегламентногоМероприятия.Мероприятия КАК торо_АктОВыполненииРегламентногоМероприятияМероприятия
	|		ПО ВТ_ДокументыТОИР.Документ = торо_АктОВыполненииРегламентногоМероприятияМероприятия.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_АктОВыполненииРегламентногоМероприятияМероприятия.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия
	|		ПО ВТ_ДокументыТОИР.Документ = торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗакрытиеЗаявокИРемонтов.ЗакрываемыеЗаявки КАК торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ЗакрытиеЗаявокИРемонтовЗакрываемыеЗаявки.ИДРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.ДокументыОснования КАК торо_ВыявленныеДефектыДокументыОснования
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ВыявленныеДефектыДокументыОснования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	|		ПО ВТ_ДокументыТОИР.Значение = торо_ПланГрафикРемонтаПланРемонтов.ID
	|			И ВТ_ДокументыТОИР.Документ = торо_ПланГрафикРемонтаПланРемонтов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов
	|		ПО ВТ_ДокументыТОИР.Значение = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.ID
	|			И ВТ_ДокументыТОИР.Документ = торо_ГрафикРегламентныхМероприятийТОиРПланРемонтов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АнализКоренныхПричин КАК торо_АнализКоренныхПричин
	|		ПО ВТ_ДокументыТОИР.Документ = торо_АнализКоренныхПричин.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_АнализКоренныхПричин.ИДРемонта
	#Вставка //++ Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК торо_ВнешнееОснованиеДляРаботОбследованноеОборудование
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	|			ПО торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка = торо_ВнешнееОснованиеДляРабот.Ссылка
	|				И (торо_ВнешнееОснованиеДляРабот.ДокументОснование <> НЕОПРЕДЕЛЕНО)
	|		ПО ВТ_ДокументыТОИР.Документ = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка
	|			И ВТ_ДокументыТОИР.Значение = торо_ВнешнееОснованиеДляРаботОбследованноеОборудование.ID
	#КонецВставки //-- Проф-ИТ, #357, Соловьев А.А., 20.11.2023
	|        %СлужебныеСоединение%
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыМТО.Документ,
	|	ВТ_ДокументыМТО.Проведен,
	|	ВТ_ДокументыМТО.ПометкаУдаления,
	|	ВТ_ДокументыМТО.Основание
	|ИЗ
	|	ВТ_ДокументыМТО КАК ВТ_ДокументыМТО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодготовленныеДанные.Документ КАК Документ,
	|	ПодготовленныеДанные.Проведен КАК Проведен,
	|	ПодготовленныеДанные.ПометкаУдаления КАК ПометкаУдаления,
	|	ПодготовленныеДанные.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодготовленныеДанные.Документ КАК Документ
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные
	|ГДЕ
	|	ПодготовленныеДанные.ДокументОснование = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Задание.Ссылка КАК Документ,
	|	Задание.Предмет КАК ДокументОснование,
	|	Задание.ПометкаУдаления КАК ПометкаУдаления,
	|	NULL КАК Проведен
	|ИЗ
	|	ПодготовленныеДанные КАК ПодготовленныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.Задание КАК Задание
	|		ПО ПодготовленныеДанные.Документ = Задание.Предмет";

	Если ПоказатьСлужебные Тогда
		ПодстрокаЗамены = "КОГДА НЕ торо_ПроектныеЗатратыНаРемонты.ДокументИсточник ЕСТЬ NULL
		|    ТОГДА торо_ПроектныеЗатратыНаРемонты.ДокументИсточник
		|КОГДА НЕ торо_ПлановыеЗатраты.ДокументПлана ЕСТЬ NULL
		|	   ТОГДА торо_ПлановыеЗатраты.ДокументПлана";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Служебные%", ПодстрокаЗамены);

		ПодстрокаЗамены = "ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПлановыеЗатраты КАК торо_ПлановыеЗатраты
		|ПО ВТ_ДокументыТОИР.Документ = торо_ПлановыеЗатраты.Ссылка
		|		И ВТ_ДокументыТОИР.Значение = торо_ПлановыеЗатраты.РемонтыОборудования_ID
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПроектныеЗатратыНаРемонты КАК торо_ПроектныеЗатратыНаРемонты
		|ПО ВТ_ДокументыТОИР.Документ = торо_ПроектныеЗатратыНаРемонты.Ссылка
		|		И ВТ_ДокументыТОИР.Значение = торо_ПроектныеЗатратыНаРемонты.IDРемонта";

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СлужебныеСоединение%", ПодстрокаЗамены);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Служебные%", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СлужебныеСоединение%", "");
	КонецЕсли;

	Запрос.УстановитьПараметр("Таблица", ТаблицаДокументовКО);
	Запрос.УстановитьПараметр("МассивИД", СтруктураМассивID.МассивID);
	УстановитьПривилегированныйРежим(Истина);
	РезЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь); 
	Если РезЗапроса[4].Пустой() Тогда 
		Возврат;
	КонецЕсли;

	ТаблицаДляСвертки = РезЗапроса[5].Выгрузить();
	ДокументыТаблицы = ТаблицаДляСвертки.ВыгрузитьКолонку("Документ");
	ТаблицаДляСвертки.Колонки.Удалить("Документ");
	ТаблицаДляСвертки.Колонки.Добавить("Документ");
	ТаблицаДляСвертки.ЗагрузитьКолонку(ДокументыТаблицы, "Документ");

	ДокументыТаблицы = ТаблицаДляСвертки.ВыгрузитьКолонку("ДокументОснование");
	ТаблицаДляСвертки.Колонки.Удалить("ДокументОснование");
	ТаблицаДляСвертки.Колонки.Добавить("ДокументОснование");
	ТаблицаДляСвертки.ЗагрузитьКолонку(ДокументыТаблицы, "ДокументОснование");

	ТаблицаДляДопОбхода = РезЗапроса[6].Выгрузить();
	Для Каждого Строка Из ТаблицаДляДопОбхода Цикл
		МассивПодчиненныхДокументов = ПодчиненныеСвязанныеДокументы(Строка.Документ);		
		Для Каждого ПодчиненнаяСтрока Из МассивПодчиненныхДокументов Цикл
			НоваяСтрока = ТаблицаДляСвертки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодчиненнаяСтрока);
		КонецЦикла;
	КонецЦикла;

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ВводНачальныхДанных") Тогда
		НоваяСтрока = ТаблицаДляСвертки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Документ);
		НоваяСтрока.Документ = Документ;
		НоваяСтрока.ДокументОснование = "";	
	КонецЕсли;

	НомерРезультатаБизнесПроцессы = 7;
	ТаблицаДляДопОбхода = РезЗапроса[НомерРезультатаБизнесПроцессы].Выгрузить();
	Для Каждого Строка Из ТаблицаДляДопОбхода Цикл
		НоваяСтрока = ТаблицаДляСвертки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

	ТаблицаДляСвертки.Свернуть("Документ, Проведен, ПометкаУдаления, ДокументОснование");

	СписокДокументов.Загрузить(ТаблицаДляСвертки);

	ДеревоДокументов.ПолучитьЭлементы().Очистить();

	Для Каждого Строка Из ТаблицаДляСвертки Цикл
		Если Строка.ДокументОснование = "" Тогда
			НоваяСтрока = ДеревоДокументов.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Картинка = ПолучитьИндексКартинкиВКоллекции(Строка);
			СоздатьВетвьДерева(НоваяСтрока);
		КонецЕсли; 
	КонецЦикла;  

КонецПроцедуры

#КонецОбласти