
//++ Проф-ИТ, #188, Соловьев А.А., 20.12.2023

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент				= Элементы.Добавить("проф_НаправлениеДеятельности", Тип("ПолеФормы"), ЭтотОбъект);
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.проф_НаправлениеДеятельности";
	Элементы.Переместить(НовыйЭлемент, ЭтотОбъект, Элементы.ГруппаСтатусСогласования);
	
КонецПроцедуры

#КонецОбласти

//-- Проф-ИТ, #188, Соловьев А.А., 20.12.2023