
#Область СлужебныйПрограммныйИнтерфейс

// Используется в процедурах ПриЗаполненииОграниченияДоступа для документов с объектами ремонта,
// для верного заполнения ограничения по объекту ремонта. Вынесено отдельно, т.к. ограничение
// сложное и может меняться со временем.
//
// Параметры:
//		ИмяТаблицы - Строка - имя таблицы справочника торо_ОбъектыРемонта, присоединенной для наложения ограничения.
//
// Возвращаемое значение:
//		Строка - текст ограничения для подстановки.
//
Функция ПолучитьОграничениеДоступаДляОбъектаРемонтаВТаблице(ИмяТаблицыИлиПоля = "торо_ОбъектыРемонта", ЭтоИмяПоля = Ложь) Экспорт
	
	ТекстОграничения =
	"(торо_ОбъектыРемонта.ВнешнийОбъект
	|	И ЗначениеРазрешено(торо_ОбъектыРемонта.Ссылка, NULL КАК ИСТИНА)
	|	И ЗначениеРазрешено(торо_ОбъектыРемонта.Контрагент, NULL КАК ИСТИНА))
	|	ИЛИ 
	|	(НЕ торо_ОбъектыРемонта.ВнешнийОбъект
	|		И ЗначениеРазрешено(торо_ОбъектыРемонта.Ссылка, NULL КАК ИСТИНА)
	|		И ЗначениеРазрешено(торо_ОбъектыРемонта.Организация, NULL КАК ИСТИНА)
	|  	И ЗначениеРазрешено(торо_ОбъектыРемонта.Подразделение, NULL КАК ИСТИНА))";
	
	Если ИмяТаблицыИлиПоля <> "торо_ОбъектыРемонта" Тогда
		ТекстОграничения = СтрЗаменить(ТекстОграничения, "торо_ОбъектыРемонта", ИмяТаблицыИлиПоля);
	КонецЕсли;
	
	Если ЭтоИмяПоля Тогда
		ТекстОграничения = СтрЗаменить(ТекстОграничения, ".Ссылка", "");
	КонецЕсли;
	
	Возврат ТекстОграничения;
	
КонецФункции

Процедура ЗаполнитьПоставляемыеПрофилиДоступаТОИР(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ДобавитьПрофильТОиР(ОписанияПрофилей);
	
	ДобавитьПрофильОператора(ОписанияПрофилей);
	ДобавитьПрофильДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильМеханика(ОписанияПрофилей);
	ДобавитьПрофильИнженера(ОписанияПрофилей);		
	ДобавитьПрофильУтверждениеНормативов(ОписанияПрофилей);
	ДобавитьПрофильАнализЭффективности(ОписанияПрофилей);
	ДобавитьПрофильСпециалистИБ(ОписанияПрофилей);
	ДобавитьПрофильУправлениеРисками(ОписанияПрофилей);
	ДобавитьПрофильТехнолог(ОписанияПрофилей);
	ДобавитьПрофильСпециалистПоОбеспечениюТМЦ(ОписанияПрофилей);
	ДобавитьПрофильКладовщик(ОписанияПрофилей);
	ДобавитьПрофильИнженерОтделаНадежности(ОписанияПрофилей);
	ДобавитьПрофильНазначенияЗадач(ОписанияПрофилей);
	ДобавитьПрофильУправлениеПерсоналом(ОписанияПрофилей);
	ДобавитьПрофильТехническийДиректор(ОписанияПрофилей);
	
КонецПроцедуры

// Блокирует возможность редактирования документов с запрещенными объектами ремонта.
//
// Параметры:
//		Форма - ФормаКлиентскогоПриложения - форма документа.
//		Объект - ДокументОбъект - объект документа.
//		ИмяТаблицыОР - Строка - наименование таблицы с ОР в документе.
//
&НаСервере
Процедура УстановитьДоступностьРедактированияПоОграничениюДоступаДляОР(Форма, ТаблицаОР, ИмяКолонкиОР = "ОбъектРемонта") Экспорт

	Если НЕ Константы.ОграничиватьДоступНаУровнеЗаписей.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОР.ОбъектРемонта КАК ОбъектРемонта
	|ПОМЕСТИТЬ ВТ_ТабОР
	|ИЗ
	|	&ТаблицаОР КАК ТаблицаОР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТабОР.ОбъектРемонта КАК ОбъектРемонта
	|ИЗ
	|	ВТ_ТабОР КАК ВТ_ТабОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ВТ_ТабОР.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТабОР.ОбъектРемонта КАК ОбъектРемонта
	|ИЗ
	|	ВТ_ТабОР КАК ВТ_ТабОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_СписокОбъектовРегламентногоМероприятия КАК торо_СписокОбъектовРегламентногоМероприятия
	|		ПО ВТ_ТабОР.ОбъектРемонта = торо_СписокОбъектовРегламентногоМероприятия.Ссылка";
	
	Если ИмяКолонкиОР = "ОбъектРемонтныхРабот" Тогда
		ТаблицаОР.Свернуть("ОбъектРемонтныхРабот");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОР.ОбъектРемонта КАК ОбъектРемонта", "ТаблицаОР.ОбъектРемонтныхРабот КАК ОбъектРемонта");
	ИначеЕсли ИмяКолонкиОР = "ОбъектИерархии" Тогда
		ТаблицаОР.Свернуть("ОбъектИерархии");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОР.ОбъектРемонта КАК ОбъектРемонта", "ТаблицаОР.ОбъектИерархии КАК ОбъектРемонта");
	ИначеЕсли ИмяКолонкиОР = "Объект" Тогда
		ТаблицаОР.Свернуть("Объект");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОР.ОбъектРемонта КАК ОбъектРемонта", "ТаблицаОР.Объект КАК ОбъектРемонта");	
	Иначе
		ТаблицаОР.Свернуть("ОбъектРемонта");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаОР", ТаблицаОР);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаОР.Количество() > Результат.Количество() Тогда
		Форма.ЗапретитьРедактирование =  Истина;
		торо_РаботаССогласованиямиКлиентСервер.УстановитьТолькоПросмотрФормы(Форма, Новый Соответствие);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПрофильТОиР(ОписанияПрофилей)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "БазовыеПраваТОиР";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Базовые права ТОиР'");
	ОписаниеПрофиля.Идентификатор = "ab8ca17c-8df7-4c6f-a6ba-6dfb85a2d469";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- просмотра данных информационной системы.'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);	
	
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаЭксплуатацииДляВводаНаОснованииВыявленногоДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетТекущееСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОграниченийНаХарактеристикиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПараметровНаработкиОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановыхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеОбменаСМобильнымПриложением");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТекущихКадровыхДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовСкользящихПланов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеГруппХарактеристикОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_СвязанныеДокументыПоТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатусыРемонтовПоЗаявкам");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрВыбытийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрПринятийОбъектовРемонтаКУчету");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСтатусовРемонта");
	
	// НазначениеНаРемонтСУчетомРисков
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовВоздействия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийВероятности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийТяжестиПоследствий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРегистраСведенийПоследствия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКатегорийРиска");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтратегийОбслуживания");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеМатрицыОценкиРисков");
	
    ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");		                                     
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------1---------------------------------1
////
Процедура ДобавитьПрофильОператора(ОписанияПрофилей)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя = "Оператор";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор'");
	ОписаниеПрофиля.Идентификатор = "6c707460-f5fe-4cb2-bec1-ac7481e2258b";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- учета наработки объектов ремонта,
				|- учета контролируемых показателей,
				|- учета состояний объектов ремонта.'");
	
	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровНаработкиОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьНастройкуПоказателейЭксплуатацииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудованияСПоследнихРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетТекущееСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_СвязанныеДокументыПоТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаНаОтказ");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналСостоянийОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетКТГОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВводаНачальногоСостоянияПоОбъектамРемонта");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------2---------------------------------2
////
Процедура ДобавитьПрофильДиспетчера(ОписанияПрофилей)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();

	ОписаниеПрофиля.Имя = "Диспетчер";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Диспетчер'");
	ОписаниеПрофиля.Идентификатор = "43f2f015-280b-4546-8731-3b399b49049a";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- регистрации дефектов объектов ремонта,
				|- учета состояний объектов ремонта,
				|- оформления заявок на ремонт.'");	
	
	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
    // Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияСостоянияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализДефектовИПотерь");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетРецидивныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования"); 	
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетТекущееСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	ОписаниеПрофиля.Роли.Добавить("торо_СвязанныеДокументыПоТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияИзмененияДатРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналСостоянийОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетКТГОборудования");  
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВводаНачальногоСостоянияПоОбъектамРемонта");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатусыРемонтовПоЗаявкам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтавокНДС");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКорректировокОстатковНаСкладах");
	
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//	
КонецПроцедуры

// -----------3---------------------------------3
//
Процедура ДобавитьПрофильМеханика(ОписанияПрофилей)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();	
	
	ОписаниеПрофиля.Имя = "Механик";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Механик'");
	ОписаниеПрофиля.Идентификатор = "5aa39e65-c646-4ba3-b56a-b65fd753a3bf";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- оформления заявок на ремонт.'");   
	
	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализДефектовИПотерь");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетРецидивныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");

	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияИзмененияДатРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналСостоянийОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетКТГОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланЗакупок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОбеспеченностьПлановойПотребности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");
	ОписаниеПрофиля.Роли.Добавить("торо_СвязанныеДокументыПоТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатусыРемонтовПоЗаявкам");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКорректировокОстатковНаСкладах");
	
	// Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------4---------------------------------4
////   
Процедура ДобавитьПрофильИнженера(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "Инженер";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Инженер'");
	ОписаниеПрофиля.Идентификатор = "36bc60d8-a5aa-4d98-b4d7-15eab6d88494";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- учета объектов ремонта;
				|- планирования ППР, регламентных мероприятий;
				|- учета выполненных работ.'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("торо_ВыгрузкаИЗагрузкаИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеОстановочныхРемонтов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевВыбораПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияНаправленийОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияШаблоновСообщенийИУведомлений");
	
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокКоэффициентовПереводаСтоимостей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУчетовНаработкиОборудования");
	
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровНаработкиОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзмененияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеВыбораРемонтаИзПланГрафика");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеЗакрытияЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКорректировокППРПоРМ");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораОбъектовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораРемонтныхРаботОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеТехническойДокументации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеУстановкиОценкиРМПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьНастройкуПоказателейЭксплуатацииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьОбщийПланРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоУчетаПоказателейЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВалютыРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаВидаРемонтаПриВводеНаОснованииВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИерархииДляВводаНовыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияЛотов");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияНарядовДопусковНаРаботыПовышеннойОпасностиОбязательно");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияОпасногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияПриоритетностиПеренесенныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализДефектовИПотерь");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетРецидивныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияИзмененияДатРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетТекущееСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияСписокОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПросмотрФормыСпискаДокументовПоРемонту");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииРегламентныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовОВыполненииЭтаповРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАктовПриемкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВводаНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовОценок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаявокИРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаявокНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКомиссионныхРассмотрений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевВыбораПодрядчиков"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритериевОценки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаВыполнениеРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНарядовНаРегламентноеМероприятие");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОценокРаботыПодрядчика");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПриоритетовОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПрисвоенийКвалификацийСотрудникам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПричинПростояОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСтруктурОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУсловийВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокПроизвольныхЗначенийНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовКонтролируемыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУчетовНаработкиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЦепочекРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеШаблоновСообщенийИУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеППРДляРасчетаВФоновомРежиме");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОпасныхПроизводств");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеРемонтныхЦикловОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаНаОтказ");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудованияСПоследнихРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОстановочныеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализЗагруженностиБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналСостоянийОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетКТГОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланЗакупок");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОбеспеченностьПлановойПотребности");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКалькулятораРЦ");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаКоличестваДнейСмещенияВДефектеДляПростоев");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКорректировокОстатковНаСкладах");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПланаРаботПодразделения");
	ОписаниеПрофиля.Роли.Добавить("торо_СвязанныеДокументыПоТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_СвязанныеДокументыМТОПоТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатусыРемонтовПоЗаявкам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗапланированныеРемонтыОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРесурсногоПланирования");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеСостоянийСотрудника");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановойДоступностиПерсонала");
	
	// Согласования и  уведомления
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСобытийУведомленийВДокументах");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСтатусовСогласованияДокументовРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДокументовУведомлений");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	
	// Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеСозданияДополнительныхИерархий");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаАдресацияЗаявок");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКонтроляРезультатовПаспортизации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоВыполненияОстановочныхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеГенерацииШтрихКодов");

	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияПринятийОРКУчету");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВыбытийОбъектовРемонта");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------5---------------------------------5
////
Процедура ДобавитьПрофильУтверждениеНормативов(ОписанияПрофилей)

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "УтверждениеНормативов";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Нормативы и НСИ'");
	ОписаниеПрофиля.Идентификатор = "349c7ae2-0474-11e5-bf1f-8eb2736043cf";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- учета нормативов;
				|- учета НСИ.'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеТехнологическихКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеТиповыхОР");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровОповещенияОСостоянииОР");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДоговорыКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаГрафикаРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияПараметровВыработкиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовПусковОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВидовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеЗначенийКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехКарт");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияМерБезопасности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинЗакрытияРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинИзмененияНаработки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПричинПростояОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСезонов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеСпискаОбъектовРегламентногоМероприятия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСпособовПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияТехнологическихОпераций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхДефектовОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеТиповКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияУсловияВыявленияДефекта");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияЦепочкиРемонта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияУпаковокНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПараметровАвтоматическойФиксацииДефектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДолжностей");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВводНачальныхДанных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеНастройкиРегистрацииНаработкиЗависимыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокКоэффициентовПереводаСтоимостейРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокКоэффициентовПереводаСтоимостей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеКоэффициентовРемонтныхОсобенностей");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокЛимитовНаПлановыеРемонтныеРаботы");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийПоложенияВСтруктуреИерархии");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьНастройкуПоказателейЭксплуатацииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияИзмеряемыхПоказателейОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеПараметровНаработкиОбъектовРемонта");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСтратегийОбслуживания");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеКонтроляРезультатовПаспортизации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСтавокНДС");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеГенерацииШтрихКодов");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------6---------------------------------5
////
Процедура ДобавитьПрофильАнализЭффективности(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "АнализЭффективности";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Анализ эффективности'");
	ОписаниеПрофиля.Идентификатор = "cde10382-4b4c-4a32-a7d7-1f50a9c0997e";
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Предназначен для:
				|- просмотра отчетов.'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_РазделПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияПоказателиKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаЦелевыхЗначенийПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаЦелевыхЗначенийПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВариантовАнализаПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияВариантовАнализаПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРегистрацияЗначенийВнешнихПоказателейKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПросмотрМонитораKPI");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоВыполненияОстановочныхРемонтов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализДефектовИПотерь");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализЗагруженностиБригад");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетБазаДанныхПоПодрядчикамСИсторией");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетРецидивныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетДлительностьСогласованияДокументов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияИзмененияДатРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияОстановаИЗапускаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаНаОтказ");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОборудованияСПоследнихРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетНаработкаОРПоДатам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОстановочныеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОтказыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеОстановыОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактВыполненияРаботПодрядчиками");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактныйАнализППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПринятиеКУчетуВыбытиеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПростойОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетТекущееСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("ОтчетВедомостьПоТоварамНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатистикаПотребления");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналСостоянийОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетКТГОборудования"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОбеспеченностьПлановойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаРаботыСотрудников");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКоренныхПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАнализаКоренныхПричин");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализЧастотыКоренныхПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналКорректирующихМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЖурналПроведенныхАнализовКоренныхПричин");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРезервовПодВнутреннийЗаказ");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПередачТоваровНаРуки");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------7---------------------------------7
////
Процедура ДобавитьПрофильСпециалистИБ(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "СпециалистИБ";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Специалист ИБ'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.СпециалистИБ.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- просмотра журнала регистрации действий пользователей
	|	- просмотра подключенных сессий, активных пользователей'");
	
	// Обязательные права
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("торо_БазовыеПрава");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеОбработкиАктивныеПользователи");    
	ОписаниеПрофиля.Роли.Добавить("торо_РазделНастройкаИАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("Администрирование");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------8---------------------------------8
////
Процедура ДобавитьПрофильУправлениеРисками(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "УправлениеРисками";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление рисками'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.УправлениеРисками.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- редактирования справочников для назначения ремонтов с учетом рисков 
	|	- редактирования настроек для назначения ремонтов с учетом рисков'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияОбъектовВоздействия");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКатегорийВероятности");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКатегорийТяжестиПоследствий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКатегорийРиска");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеМатрицыОценкиРисков");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКритичностейДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_РедактированиеРегистраСведенийПоследствия");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------9---------------------------------9
////
Процедура ДобавитьПрофильТехнолог(ОписанияПрофилей)
	 
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "Технолог";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Технолог'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.Технолог.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- работы с обработкой ""Рабочее место технолога"" 
	|	- для настройки структуры функциональных мест'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияТиповыхОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьНастройкуПоказателейЭксплуатацииОР");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияОбъектовРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_НастройкаИспользованияФункциональныхМест");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияОграниченийНаХарактеристикиОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияГруппХарактеристикОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользоватьРабочееМестоТехнолога");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеГенерацииШтрихКодов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСостояниеОборудования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоКонтролируемымПоказателям");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСписокОборудования");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------10---------------------------------10
////
Процедура ДобавитьПрофильСпециалистПоОбеспечениюТМЦ(ОписанияПрофилей)
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "СпециалистПоОбеспечениюТМЦ";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Специалист по обеспечению ТМЦ'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.СпециалистПоОбеспечениюТМЦ.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- работы с обработкой ""Рабочее место специалиста обеспечения""'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛогистическихПараметров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияКонтрагентов"); 
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСерийНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияХарактеристикНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияВидовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтавокНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");

	// Документы
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРезервовПодВнутреннийЗаказ");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияРезервовПодВнутренниеЗаказы");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовПоставщику");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияПоступленийТоваровУслуг");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияПеремещенийТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияВнутреннихПотребленийТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановокМинимальныхОстатковНоменклатуры");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияЗакрытийВнутреннихЗаказов");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийНедостачТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКорректировокОстатковНаСкладах");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ОтчетВедомостьПоТоварамНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОстаткиНоменклатурыНаРуках");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВедомостьПоТоварамНаРуках");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатистикаПотребления");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланЗакупок"); 
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОбеспеченностьПлановойПотребности");
	
	// Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаСпециалистаОбеспечения");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");
	
	// Бизнес-сеть 
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатурыКонтрагентовБЭД");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТорговыхПредложений");
								  
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой"); 
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыгрузкиРаботаСНоменклатурой"); 
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД"); 
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

//// -----------11---------------------------------11
////
Процедура ДобавитьПрофильКладовщик(ОписанияПрофилей)
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "Кладовщик";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кладовщик'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.Кладовщик.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- работы с обработкой ""Передача на руки / возврат на склад""'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	
	// Документы
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПередачТоваровНаРуки");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияПередачТоваровНаРуки");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВозвратовНаСклад");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияВозвратовТоваровНаСклад");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияПеремещенийТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеИнвентаризации");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияИнвентаризации");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийНедостачТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияСписанийНедостачТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияОприходованийИзлишковТоваров");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеКорректировокОстатковНаСкладах");
		
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ОтчетВедомостьПоТоварамНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОстаткиНоменклатурыНаРуках");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВедомостьПоТоварамНаРуках");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланЗакупок");
	
	// Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаПередачаНаРукиВозвратНаСклад");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеРабочегоМестаПолучениеИВозвратМатериалов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПодбораНоменклатуры");

	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
КонецПроцедуры

//// -----------12---------------------------------12
////
Процедура ДобавитьПрофильИнженерОтделаНадежности(ОписанияПрофилей)
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "ИнженерОтделаНадежности";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Инженер отдела надежности'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.ИнженерОтделаНадежности.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- редактирования справочников и документов для анализа причин дефектов 
	|	- работы с отчетами и обработкой ""Проведение анализа причин дефектов""'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКоренныхПричинДефектов");
		
	// Документы
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеАнализаКоренныхПричин");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеАнализаКоренныхПричин");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеАнализаКоренныхПричин");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеАнализаКоренныхПричин");
	ОписаниеПрофиля.Роли.Добавить("торо_ПометкаУдаленияАнализаКоренныхПричин");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеВнешнихОснованийДляРабот");
	ОписаниеПрофиля.Роли.Добавить("торо_ПроведениеВнешнихОснованийДляРабот");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализЧастотыКоренныхПричинДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЖурналКорректирующихМероприятий");
	ОписаниеПрофиля.Роли.Добавить("торо_ЖурналПроведенныхАнализовКоренныхПричин");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВыявленныеДефекты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетРецидивныеДефекты");
		
	// Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеПроведениеАнализаКоренныхПричин");
	
	// Задания
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	
	// внезапное
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровойИсторииСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОприходованийИзлишковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗакрытийЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеРезервовПодВнутреннийЗаказ");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВозвратовНаСклад");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПередачТоваровНаРуки");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
КонецПроцедуры

//// -----------13---------------------------------11
////
Процедура ДобавитьПрофильНазначенияЗадач(ОписанияПрофилей)
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "НазначениеЗадач";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Назначение задач'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.НазначениеЗадач.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- назначения задач пользователям'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
КонецПроцедуры

//// -----------14---------------------------------14
////
Процедура ДобавитьПрофильУправлениеПерсоналом(ОписанияПрофилей) 
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "УправлениеПерсоналом";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление персоналом'");
	ОписаниеПрофиля.Идентификатор =  Строка(Справочники.ПрофилиГруппДоступа.УправлениеПерсоналом.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание =  НСтр("ru = 'Предназначен для:
	|	- работы с подсистемой ""Управление персоналом""'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Подсистема
	ОписаниеПрофиля.Роли.Добавить("торо_РазделУправлениеПерсоналом");
	
	// Справочники
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");  					
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияДолжностей");         					
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПометкаУдаленияСотрудников"); 
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКвалификацийРемонтногоПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияКомиссий");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРемонтныхБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияРесурсовРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПометкаУдаленияСостоянийСотрудника");

	// Документы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияКадровыхПереводов");		
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияПриемовНаРаботу");       
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияУвольнений");			
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеИзмененийСоставаРемонтнойБригады");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановойДоступностиПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияПлановойДоступностиПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПометкаУдаленияУстановокСтоимостейКвалификаций");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеПрисвоенийКвалификацийСотрудникам");

	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализИспользованияПерсонала");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетАнализЗагруженностиБригад");

	// Обработки
	ОписаниеПрофиля.Роли.Добавить("торо_ИспользованиеУправлениемПлановойДоступностьюПерсонала");
	
	// Регистры
	ОписаниеПрофиля.Роли.Добавить("ИзменениеГрафикаРаботыСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКадровойИсторииСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущихКадровыхДанныхСотрудников");
	ОписаниеПрофиля.Роли.Добавить("торо_ИзменениеТекущихТарифныхСтавокСотрудников");
	
	// Журналы
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЖурналаКадровыхДокументов");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
КонецПроцедуры

//// -----------15---------------------------------15
////
Процедура ДобавитьПрофильТехническийДиректор(ОписанияПрофилей) 
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	
	ОписаниеПрофиля.Имя = "ТехническийДиректор";
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Технический директор'");
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ТехническийДиректор.УникальныйИдентификатор());
	ОписаниеПрофиля.Описание = НСтр("ru = 'Предназначен для:
	|	- утверждения заказов на внутренние потребления'");

	УправлениеДоступомПереопределяемый.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	// Подсистема
	ОписаниеПрофиля.Роли.Добавить("торо_РазделМТО");
	
	// Справочники
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовЦен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтавокНДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковокНоменклатуры");
	
	ОписаниеПрофиля.Роли.Добавить("торо_УтверждениеЗаказовНаВП");
	
	// Документы
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроведениеПометкаУдаленияЗаказовНаВнутреннееПотребление");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеЗаказовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровУслуг");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановокМинимальныхОстатковНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПланаРаботПодразделения");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеУстановкаАналоговНоменклатурыДляРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ДобавлениеИзменениеПроведениеУстановкаАналоговНоменклатурыДляРемонтов");
	
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеПлановГрафиковРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеГрафиковРегламентныхМероприятийТОиР");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВыявленныхДефектов");
	ОписаниеПрофиля.Роли.Добавить("торо_ЧтениеВнешнихОснованийДляРабот");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланМТОИнструментовТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланФактЗатрат");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВедомостьПоТоварамНаРуках");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетЗатратыНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПоМинимальнымОстаткам");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОбеспеченностьПлановойПотребности");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОстаткиНоменклатурыНаРуках");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетОстаткиНоменклатурыНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПланЗакупок");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСостояниеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСтатистикаПотребления");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПлановыеВнеплановыеРемонты");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетВнешниеОснования");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПричиныОтменыПлановыхРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетСводнаяДиаграммаГрафиковППР");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетИсторияИзмененияДатРемонта");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетПрямыеЗатратыНаВыполнениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("торо_ОтчетФактическиеЗатратыПоОбъектамРемонта");
	ОписаниеПрофиля.Роли.Добавить("ОтчетВедомостьПоТоварамНаСкладах");
	
	// Регистры
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛогистическихПараметров");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти
