#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Сформировать кадровые движения
//
// Параметры:
//  РегистраторОбъект	 - ДокументОбъект.Увольнение,ДокументОбъект.ПриемНаРаботу,ДокументОбъект.КадровыйПеревод	 - 
//							Документ по которому формируются движения.
//  Движения			 - КоллекцияДвижений	 - Коллекция движений, в которой необходимо заполнить кадровые движения.
//  КадровыеДвижения	 - ТаблицаЗначений	 - Таблица значений с полями:
//		ДатаСобытия
//		ВидСобытия - Перечисление.ВидыКадровыхСобытий
//		ДействуетДо (не обязательно)
//		Сотрудник
//		Позиция (не обязательно)
//		Подразделение (не обязательно)
//		Должность (не обязательно)
// 		КоличествоСтавок (не обязательно).
Процедура СформироватьКадровыеДвижения(РегистраторОбъект, Движения, КадровыеДвижения) Экспорт
	
	КадровыйУчетРасширенный.СформироватьКадровыеДвижения(РегистраторОбъект, Движения, КадровыеДвижения);

КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
// Формирование временных таблиц с кадровыми данными

// Функция формирует временную таблицу с кадровыми данными. 
// Параметры:
//         ТолькоРазрешенные - Булево
//         ИмяВТКадровыеДанныеФизическихЛиц - строка
//         ИмяВременнойТаблицыОтборовФизическихЛиц - строка
//		   КадровыеДанные - см. описание к функции КадровыеДанныеФизическихЛиц 
//         ПоляОтбораФизическихЛиц  - структура
//         ПоляОтбораПериодическихДанных -  см. описание к функции КадровыеДанныеФизическихЛиц.
//
// Возвращаемое значение:
//	Запрос - подготовленный запрос.
//
Функция ЗапросВТКадровыеДанныеФизическихЛиц(ТолькоРазрешенные, ИмяВТКадровыеДанныеФизическихЛиц, ИмяВременнойТаблицыОтборовФизическихЛиц, ПоляОтбораФизическихЛиц, КадровыеДанные, ПоляОтбораПериодическихДанных) Экспорт
	
	Возврат КадровыйУчетРасширенный.ЗапросВТКадровыеДанныеФизическихЛиц(ТолькоРазрешенные, ИмяВТКадровыеДанныеФизическихЛиц, ИмяВременнойТаблицыОтборовФизическихЛиц, ПоляОтбораФизическихЛиц, КадровыеДанные, ПоляОтбораПериодическихДанных);
	
КонецФункции

// Осуществляет запрос во временную таблицу кадровых данных о сотрудниках.
// Параметры:
// 		ТолькоРазрешенные - Булево
//			ИмяВТКадровыеДанныеСотрудников - строка
//       ИмяВременнойТаблицыОтборовСотрудников - строка
//       ПоляОтбораСотрудников - структура
//       КадровыеДанные - структура
//       ПоляОтбораПериодическихДанных  - структура.
//
// Возвращаемое значение:
//	Запрос - подготовленный запрос.
//
Функция ЗапросВТКадровыеДанныеСотрудников(ТолькоРазрешенные, ИмяВТКадровыеДанныеСотрудников, ИмяВременнойТаблицыОтборовСотрудников, ПоляОтбораСотрудников, КадровыеДанные, ПоляОтбораПериодическихДанных) Экспорт
	
	Возврат КадровыйУчетРасширенный.ЗапросВТКадровыеДанныеСотрудников(ТолькоРазрешенные, ИмяВТКадровыеДанныеСотрудников, ИмяВременнойТаблицыОтборовСотрудников, ПоляОтбораСотрудников, КадровыеДанные, ПоляОтбораПериодическихДанных);
	
КонецФункции

Функция ЗапросВТСотрудникиОрганизации(ТолькоРазрешенные, ИмяВТСотрудникиОрганизации, Параметры) Экспорт
	
	Возврат КадровыйУчетРасширенный.ЗапросВТСотрудникиОрганизации(ТолькоРазрешенные, ИмяВТСотрудникиОрганизации, Параметры);
	
КонецФункции

Функция НеобходимыТекущиеДанныеСотрудника(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыТекущиеДанныеСотрудника(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымПоИмениЗапрашиваемыхТекущихДанныхСотрудника(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.ПутьКДаннымПоИмениЗапрашиваемыхТекущихДанныхСотрудника(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымПоИмениЗапрашиваемойТекущейТарифнойСтавкиСотрудника(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетРасширенный.ПутьКДаннымПоИмениЗапрашиваемойТекущейТарифнойСтавкиСотрудника(ИмяПоля);
	
КонецФункции

Процедура ОбновитьТекущиеКадровыеДанныеСотрудников(Запрос) Экспорт
	
	КадровыйУчетРасширенный.ОбновитьТекущиеКадровыеДанныеСотрудников(Запрос);
	
КонецПроцедуры

Функция НеобходимыСведенияПриказаОПриеме(Знач ИмяПоля) Экспорт
	
	Возврат КадровыйУчетРасширенный.НеобходимыСведенияПриказаОПриеме(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымПоИмениДанныхПриказаОПриеме(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетРасширенный.ПутьКДаннымПоИмениДанныхПриказаОПриеме(ИмяПоля)
	
КонецФункции

Функция ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц() Экспорт
		
	Возврат КадровыйУчетРасширенный.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
КонецФункции

#КонецОбласти
