#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.Период,
	               |	Таб.ВидРемонта,
	               |	Таб.Сезон,
	               |	Таб.ГруппаОбъектовРемонтов
	               |ПОМЕСТИТЬ ИсходнаяТаб
	               |ИЗ
	               |	&Таб КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИсходнаяТаб.Период,
	               |	ИсходнаяТаб.ВидРемонта,
	               |	ИсходнаяТаб.Сезон,
	               |	ЕСТЬNULL(торо_Сезоны.ДатаНачалаСезона, ДАТАВРЕМЯ(2, 1, 1)) КАК ДатаНачала,
	               |	ЕСТЬNULL(торо_Сезоны.ДатаОкончанияСезона, ДАТАВРЕМЯ(2, 12, 31)) КАК ДатаОкончания,
	               |	ИсходнаяТаб.ГруппаОбъектовРемонтов,
	               |	торо_Сезоны.Переходящий
	               |ПОМЕСТИТЬ ТаблицаДат
	               |ИЗ
	               |	ИсходнаяТаб КАК ИсходнаяТаб
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.торо_Сезоны КАК торо_Сезоны
	               |		ПО ИсходнаяТаб.Сезон = торо_Сезоны.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДатСравнения.ВидРемонта,
	               |	ТаблицаДатСравнения.Сезон,
	               |	ТаблицаДатСравнения.Период,
	               |	ТаблицаДат.Сезон КАК СезонПересечения,
	               |	ТаблицаДат.ДатаНачала КАК ДатаНачалаПересечения,
	               |	ТаблицаДат.ДатаОкончания КАК ДатаОкончанияПересечения,
	               |	ТаблицаДатСравнения.ДатаНачала,
	               |	ТаблицаДатСравнения.ДатаОкончания ,
	               |	ТаблицаДатСравнения.ГруппаОбъектовРемонтов
	               |ИЗ
	               |	ТаблицаДат КАК ТаблицаДат
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДат КАК ТаблицаДатСравнения
	               |		ПО ТаблицаДат.Период = ТаблицаДатСравнения.Период
	               |			И ТаблицаДат.ВидРемонта = ТаблицаДатСравнения.ВидРемонта
	               |			И ТаблицаДат.ГруппаОбъектовРемонтов = ТаблицаДатСравнения.ГруппаОбъектовРемонтов
	               |			И ТаблицаДат.Сезон <> ТаблицаДатСравнения.Сезон
	               |			И (ВЫБОР
	               |				КОГДА ТаблицаДат.Переходящий
	               |					ТОГДА ТаблицаДат.ДатаНачала < ТаблицаДатСравнения.ДатаОкончания
	               |							ИЛИ ТаблицаДат.ДатаОкончания > ТаблицаДатСравнения.ДатаНачала
	               |				КОГДА ТаблицаДатСравнения.Переходящий
	               |					ТОГДА ТаблицаДатСравнения.ДатаНачала < ТаблицаДат.ДатаОкончания
	               |							ИЛИ ТаблицаДатСравнения.ДатаОкончания > ТаблицаДат.ДатаНачала
	               |				ИНАЧЕ НЕ(ТаблицаДат.ДатаНачала > ТаблицаДатСравнения.ДатаОкончания
	               |							ИЛИ ТаблицаДат.ДатаОкончания < ТаблицаДатСравнения.ДатаНачала)
	               |			КОНЕЦ)
	               |ГДЕ
	               |	ТаблицаДатСравнения.Сезон > ТаблицаДат.Сезон";
	
	Запрос.УстановитьПараметр("Таб",ЭтотОбъект.Выгрузить());
	
	Выборка = запрос.Выполнить().Выбрать();
	
	ТаблицаПересечения = новый ТаблицаЗначений;
	ТаблицаПересечения.Колонки.Добавить("Сезон");
	ТаблицаПересечения.Колонки.Добавить("СезонПересечения");
	
	Пока Выборка.Следующий() Цикл
		ШаблонСообщения = НСтр("ru = 'На период %1 для вида ремонта %2 обнаружено использование пересекающихся сезонов:
									 |%3 (%4-%5) и 
									 |%6 (%7-%8)'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Период, Выборка.ВидРемонта, Выборка.Сезон, Формат(Выборка.ДатаНачала,"ДФ='dd MMMM'"), Формат(Выборка.ДатаОкончания,"ДФ='dd MMMM'"),
								   Выборка.СезонПересечения, Формат(Выборка.ДатаНачалаПересечения,"ДФ='dd MMMM'"), Формат(Выборка.ДатаОкончанияПересечения,"ДФ='dd MMMM'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли