#Область Проведение

&Вместо("ИнициализироватьДанныеДокумента")
Процедура проф_ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)
	
	//++ Проф-ИТ, #288, Соловьев А.А., 31.10.2023
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Номенклатура КАК Материал,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Характеристика КАК ХарактеристикаМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Количество КАК КоличествоМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КоличествоУпаковок КАК КоличествоУпаковокМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Упаковка КАК УпаковкаМатериала,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КлючСвязиТехКарта КАК КлючСвязиТехКарта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Номенклатура КАК Аналог,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Характеристика КАК ХарактеристикаАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Количество КАК КоличествоАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.КоличествоУпаковок КАК КоличествоУпаковокАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Упаковка КАК УпаковкаАналога,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втНоменклатураСАналогами
	|ИЗ
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Материалы КАК торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы,
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Аналоги КАК торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги
	|ГДЕ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.НомерСтроки = торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Номенклатура,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Характеристика,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Количество,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.КоличествоУпаковок,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Упаковка,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КлючСвязиТехКарта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Номенклатура,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Характеристика,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Количество,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.КоличествоУпаковок,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Упаковка,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка
	|ИЗ
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Материалы КАК торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы,
	|	Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов.Аналоги КАК торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги
	|ГДЕ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.Ссылка = &Ссылка
	|	И торо_УстановкаАналоговНоменклатурыДляРемонтовМатериалы.НомерСтроки = торо_УстановкаАналоговНоменклатурыДляРемонтовАналоги.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Организация КАК Организация,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ТехКарта КАК ТехКарта,
	|	ВЫБОР
	|		КОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ = ЗНАЧЕНИЕ(Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка)
	|			ТОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.ОбъектРемонта
	|		ИНАЧЕ торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ
	|	КОНЕЦ КАК ОбъектРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта КАК НаправлениеОбъектаРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ КАК СписокОбъектовРМ,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ВидРемонта КАК ВидРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаНачалаДействия КАК Период,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаОкончанияДействия КАК ПериодЗавершения,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Подразделение КАК Подразделение,
	|	втНоменклатураСАналогами.Материал КАК Материал,
	|	втНоменклатураСАналогами.ХарактеристикаМатериала КАК ХарактеристикаМатериала,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоМатериала) КАК КоличествоМатериала,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоУпаковокМатериала) КАК КоличествоУпаковокМатериала,
	|	втНоменклатураСАналогами.УпаковкаМатериала КАК УпаковкаМатериала,
	|	втНоменклатураСАналогами.КлючСвязиТехКарта КАК КлючСвязиТехКарта,
	|	втНоменклатураСАналогами.Аналог КАК Аналог,
	|	втНоменклатураСАналогами.ХарактеристикаАналога КАК ХарактеристикаАналога,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоАналога) КАК КоличествоАналога,
	|	МАКСИМУМ(втНоменклатураСАналогами.КоличествоУпаковокАналога) КАК КоличествоУпаковокАналога,
	|	втНоменклатураСАналогами.УпаковкаАналога КАК УпаковкаАналога
	|ИЗ
	|	втНоменклатураСАналогами КАК втНоменклатураСАналогами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УстановкаАналоговНоменклатурыДляРемонтов КАК торо_УстановкаАналоговНоменклатурыДляРемонтов
	|		ПО втНоменклатураСАналогами.Ссылка = торо_УстановкаАналоговНоменклатурыДляРемонтов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Организация,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ТехКарта,
	|	ВЫБОР
	|		КОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ = ЗНАЧЕНИЕ(Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка)
	|			ТОГДА торо_УстановкаАналоговНоменклатурыДляРемонтов.ОбъектРемонта
	|		ИНАЧЕ торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ
	|	КОНЕЦ,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.НаправлениеОбъектаРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.СписокОбъектовРМ,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ВидРемонта,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаНачалаДействия,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.ДатаОкончанияДействия,
	|	торо_УстановкаАналоговНоменклатурыДляРемонтов.Подразделение,
	|	втНоменклатураСАналогами.Материал,
	|	втНоменклатураСАналогами.ХарактеристикаМатериала,
	|	втНоменклатураСАналогами.УпаковкаМатериала,
	|	втНоменклатураСАналогами.КлючСвязиТехКарта,
	|	втНоменклатураСАналогами.Аналог,
	|	втНоменклатураСАналогами.ХарактеристикаАналога,
	|	втНоменклатураСАналогами.УпаковкаАналога";
	
	Результат = Запрос.Выполнить();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаАналоговВПроизводстве", Результат.Выгрузить());
	//-- Проф-ИТ, #288, Соловьев А.А., 31.10.2023
	
КонецПроцедуры

#КонецОбласти