#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Строка Из Параметры.МассивВозврата Цикл
		НоваяСтрока = Операции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьИдентификаторСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОтрицательныеПриИзменении(Элемент)
	УстановитьИдентификаторСтроки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОперацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Операции.ТекущиеДанные);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьИдентификаторСтроки()
	
	Если НЕ ПоказыватьОтрицательные Тогда 
		Для каждого Строка Из Операции Цикл
			Если Строка.Процент <= - 100 ИЛИ Строка.Процент = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Идентификатор = Строка.ПолучитьИдентификатор();
			Элементы.Операции.ТекущаяСтрока = Идентификатор;
			Прервать;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти