
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не СпособЗакрытияВыбран Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	СпособЗакрытияВыбран = Истина;
	Закрыть(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНазад(Команда)
	СпособЗакрытияВыбран = Истина;
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти
