
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОбъектРемонта", ПараметрКоманды);
	ПараметрыФормы.Вставить("СтруктураИерархии", ПараметрыВыполненияКоманды.Источник.ТекСтруктураИерархии);
	
	ОткрытьФорму("Обработка.торо_НастройкаПоказателейЭксплуатацииОбъектовРемонта.Форма", ПараметрыФормы,, ПараметрКоманды.УникальныйИдентификатор());
КонецПроцедуры

#КонецОбласти