
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтотОбъект, ПараметрКоманды);

	Форма = ОткрытьФорму("ОбщаяФорма.торо_ФормаВыбораФайлаProjectКЗагрузке",,,,,, Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДополнительныеПараметры)
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновленныеДокументы = Новый Массив;
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Строка") И РезультатЗакрытия <> "" Тогда
		Если НРег(Прав(РезультатЗакрытия, 3)) = "mpp" Тогда
			Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
				ОбновленныеДокументы = Торо_ИнтеграцияСmsProject.ЗагрузитьЗаявки(РезультатЗакрытия, "ОстановочныйРемонт");
			Иначе
				ОбновленныеДокументы = Торо_ИнтеграцияСmsProject.ЗагрузитьЗаявки(РезультатЗакрытия);
			КонецЕсли;
		ИначеЕсли НРег(Прав(РезультатЗакрытия, 3)) = "xml" Тогда
			Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
				ОбновленныеДокументы = Торо_ИнтеграцияСmsProject.ЗагрузитьЗаявкиИзXML(РезультатЗакрытия, "ОстановочныйРемонт");
			Иначе
				ОбновленныеДокументы = Торо_ИнтеграцияСmsProject.ЗагрузитьЗаявкиИзXML(РезультатЗакрытия);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ОбновленныйДокумент из ОбновленныеДокументы Цикл
		Оповестить("ЗагрузкаИзПроджект", ОбновленныйДокумент);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
