#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Функция СоздатьЭлементСправочникаНаСервере(ПараметрСоздания,Наименование,Описание, ЭлементСправочника = Неопределено) Экспорт
	
	Если ЭлементСправочника = Неопределено Тогда
		НовыйЭлемент = Справочники.торо_ПредопределенныеСценарииРаботыСистемы.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Описание     = Описание;

	Иначе
		НовыйЭлемент = ЭлементСправочника.ПолучитьОбъект();
	КонецЕсли; 
	
	ЗначенияКонстант = ПараметрСоздания.Константы;
	
	Для каждого Константа Из ЗначенияКонстант Цикл
		НовыйЭлемент[Константа.Ключ] = Константа.Значение;
	КонецЦикла; 
	
	ВводНаОсновании = ПараметрСоздания.ВводНаОсновании;
	
	Для каждого Элемент Из ВводНаОсновании Цикл
		НС = НовыйЭлемент.ВводНаОсновании.Добавить();
		НС.ПараДокументов = Элемент.Ключ;
		НС.Значение       = Элемент.Значение;
	КонецЦикла;
	
	Попытка
		НовыйЭлемент.Записать();
		Возврат НовыйЭлемент.Ссылка;
	Исключение
		Возврат "Не удалось записать элемент справочника <Сценарии работы системы>";
	КонецПопытки;
	
		
КонецФункции
#КонецОбласти

#КонецЕсли
