
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Настройки размещения в панели отчетов. (См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов).
//
// Параметры:
//   Настройки - Коллекция - Передается "как есть" из ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//       Может использоваться для получения настроек варианта этого отчета при помощи функции ВариантыОтчетов.ОписаниеВарианта().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//       уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//       См. "Свойства для изменения" процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("торо_ИспользуютсяНаработкаИСостояния");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Наработка на отказ'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Наработка и время работы оборудования с даты обнаружения предыдущего дефекта до даты обнаружения следующего.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Наработка");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("торо_УчетНаработкиОборудования");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Наработка на отказ: наработка'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Наработка оборудования с даты обнаружения предыдущего дефекта до даты обнаружения следующего.'");
	ОписаниеВарианта.Размещение.Удалить(Метаданные.Подсистемы.торо_ПоказателиЭксплуатации.Подсистемы.торо_СостояниеНаработкаПоказатели.Подсистемы.торо_СостояниеОборудования);
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВремяРаботы");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта.ФункциональныеОпции.Добавить("торо_УчетСостоянияОборудования");
	ОписаниеВарианта.Наименование = НСтр("ru = 'Наработка на отказ: время работы'");
	ОписаниеВарианта.Описание = НСтр("ru = 'Время работы оборудования с даты обнаружения предыдущего дефекта до даты обнаружения следующего.'");
	ОписаниеВарианта.Размещение.Удалить(Метаданные.Подсистемы.торо_ПоказателиЭксплуатации.Подсистемы.торо_СостояниеНаработкаПоказатели.Подсистемы.торо_НаработкаОборудования);
КонецПроцедуры

#КонецОбласти

#КонецЕсли