#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
	Элементы.торо_СтатусУтверждения.Видимость = Константы.торо_ИспользоватьУтверждениеЗаказовНаВнутреннееПотребление.Получить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда 
		ДоступностьИзменения = НЕ Элементы.Список.ТекущиеДанные.торо_СозданПоПотребности; 
		Элементы.СписокКонтекстноеМенюУстановитьПометкуУдаления.Доступность = ДоступностьИзменения;
		Элементы.СписокКонтекстноеМенюПровести.Доступность = ДоступностьИзменения;
		Элементы.СписокКонтекстноеМенюОтменаПроведения.Доступность = ДоступностьИзменения;
		Элементы.ФормаУстановитьПометкуУдаления.Доступность = ДоступностьИзменения;
		Элементы.ФормаПроведение.Доступность = ДоступностьИзменения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
