#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'Создание новых элементов справочника недоступно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли; 
	
	Если ИмяПредопределенныхДанных = "Стратегический" Тогда
		Приоритет = 1;
	ИначеЕсли ИмяПредопределенныхДанных = "Долгосрочный" Тогда 
		Приоритет = 2;
	ИначеЕсли ИмяПредопределенныхДанных = "Годовой" Тогда
		Приоритет = 3;
	ИначеЕсли ИмяПредопределенныхДанных = "Среднесрочный" Тогда
		Приоритет = 4;
	ИначеЕсли ИмяПредопределенныхДанных = "Оперативный" Тогда
	    Приоритет = 5;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из ВидыРемонтов Цикл
		МассивИмеющихся = ВидыРемонтов.НайтиСтроки(Новый Структура("ВидРемонта", Строка.ВидРемонта));
		Если МассивИмеющихся.Количество() > 1 Тогда
			ТекстСообщения = НСтр("ru = 'В табличной части <Виды ремонтов> имеются дублирующиеся виды ремонтов'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Прервать;
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры
	
#КонецОбласти
 
#КонецЕсли