
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получает имена объектов метаданных доступных для ввода на основании.
//
// Параметры:
//   ИмяОбъектаПоиска - Строка - Имя объекта метаданных для которого получаются вводимые на его основании объекты.
//
Функция ИменаДоступныхОбъектовМетаданныхДляВводаНаОсновании(ИмяОбъектаПоиска) Экспорт
	
	НаборЗаписей = РегистрыСведений.торо_ВводНаОсновании.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(ИмяОбъектаПоиска);
	НаборЗаписей.Прочитать();
	
	ИменаВводимыхОбъектовМетаданных = Новый Массив;
	Для Каждого Запись Из НаборЗаписей Цикл 
		Если Запись.Значение Тогда
			ИменаВводимыхОбъектовМетаданных.Добавить(Запись.ДокументВводимый);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ИменаВводимыхОбъектовМетаданных;
	
КонецФункции	
	
#КонецОбласти

#КонецЕсли
