#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МультиязычностьСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если КлючНазначенияИспользования = "ОтчетПланФактАнализППР" Тогда
		Если Параметры.Свойство("ВидПростоя") Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидПростоя");
			ЭлементОтбора.ПравоеЗначение = Параметры.ВидПростоя;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти