#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МультиязычностьСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзКлассификатора(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСписок", ЭтаФорма);
	Структура = Новый Структура();
	Структура.Вставить("ИмяСправочника"     ,"торо_ОбъектыВоздействия");
	Структура.Вставить("ОписаниеОповещения" ,ОписаниеОповещения);
	торо_ЗаполнениеДокументовКлиент.ЗаполнитьСправочникДаннымиИзМакета(Структура);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ОбновитьСписок(Результат, ДопПараметры)Экспорт
	Элементы.Список.Обновить();	
КонецПроцедуры

 
#КонецОбласти

