
#Область СлужебныеПроцедурыИФункции

Процедура Свойства_ЗначенияДополнительныхРеквизитовПриИзменении(Форма, Элемент) Экспорт
	
	торо_УправлениеСвойствамиКлиентСервер.УстановитьДоступностьКомандРедактированияДопРеквизитовСведений(Форма);
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура Свойства_ЗначенияДополнительныхРеквизитовПриАктивизацииСтроки(Форма, Элемент) Экспорт
	
	торо_УправлениеСвойствамиКлиентСервер.УстановитьДоступностьКомандРедактированияДопРеквизитовСведений(Форма);
	
КонецПроцедуры

Процедура Свойства_ЗначенияДополнительныхРеквизитовПередНачаломДобавления(Форма, НаборДопРеквизитовСведений, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	Отказ = Истина;
	ДобавитьДопРеквизитСведение(Форма, НаборДопРеквизитовСведений, "ДопРеквизит");
	
КонецПроцедуры

Процедура Свойства_ЗначенияДополнительныхРеквизитовПередУдалением(Форма, НаборСвойствДопРеквизитовСведений, Элемент, Отказ) Экспорт
	
	ТекущиеДанные = Форма.Элементы.Свойства_ЗначенияДополнительныхРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ТипЭлемента = "ДопРеквизит";
	Если ТекущиеДанные.ОбщееСвойство Тогда
		Возврат;
	КонецЕсли;
	
	торо_УправлениеСвойствами.ПометитьТекущееСвойствоНаУдаление(НаборСвойствДопРеквизитовСведений, ТекущиеДанные.Свойство, ТекущиеДанные.ИндексКартинки, ТипЭлемента);

КонецПроцедуры

Процедура Свойства_ЗначенияДополнительныхРеквизитовПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт
	
	Форма.Модифицированность = Истина;
	
	ТекущиеДанные = Форма.Элементы.Свойства_ЗначенияДополнительныхРеквизитов.ТекущиеДанные;
	СтрокаОписанияРеквизита = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", ТекущиеДанные.Свойство));
	Если СтрокаОписанияРеквизита.Количество() > 0 Тогда
		СтрокаОписанияРеквизита = СтрокаОписанияРеквизита[0];
		Форма[СтрокаОписанияРеквизита.ИмяРеквизитаЗначение] = ТекущиеДанные.Значение;
	КонецЕсли;
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(Форма);
	
КонецПроцедуры

Процедура Свойства_ЗначенияДополнительныхРеквизитовВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ИмяТаблицы = "Свойства_ЗначенияДополнительныхРеквизитов";
	
	ТекущиеДанные = Форма.Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Поле.Имя = ИмяТаблицы+"Наименование" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Свойство);
		
		ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьЗависимостиДополнительныхРеквизитовВТаблице(Форма, ОписаниеОбъекта) Экспорт
	
	Для Каждого ОписаниеЗависимогоРеквизита Из Форма.Свойства_ОписаниеЗависимыхДополнительныхРеквизитов Цикл
		
		Если ОписаниеЗависимогоРеквизита.УсловиеДоступности <> Неопределено Тогда
			Параметры = Новый Структура;
			Параметры.Вставить("ЗначенияПараметров", ОписаниеЗависимогоРеквизита.УсловиеДоступности.ЗначенияПараметров);
			Параметры.Вставить("Форма", Форма);
			Параметры.Вставить("ОписаниеОбъекта", ОписаниеОбъекта);
			Результат = Вычислить(ОписаниеЗависимогоРеквизита.УсловиеДоступности.КодУсловия);
			
			СтрокаОписанияРеквизита = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаЗначение", ОписаниеЗависимогоРеквизита.ИмяРеквизитаЗначение));
			Если СтрокаОписанияРеквизита.Количество() > 0 Тогда
				СтрокаОписанияРеквизита = СтрокаОписанияРеквизита[0];
				СтрокиЗначений = Форма.Свойства_ЗначенияДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство",СтрокаОписанияРеквизита.Свойство));
				Для каждого СтрокаЗначения из СтрокиЗначений Цикл
					СтрокаЗначения.Доступность = Результат;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеЗависимогоРеквизита.УсловиеВидимости <> Неопределено Тогда
			Параметры = Новый Структура;
			Параметры.Вставить("ЗначенияПараметров", ОписаниеЗависимогоРеквизита.УсловиеВидимости.ЗначенияПараметров);
			Параметры.Вставить("Форма", Форма);
			Параметры.Вставить("ОписаниеОбъекта", ОписаниеОбъекта);
			Результат = Вычислить(ОписаниеЗависимогоРеквизита.УсловиеВидимости.КодУсловия);
			
			СтрокаОписанияРеквизита = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаЗначение", ОписаниеЗависимогоРеквизита.ИмяРеквизитаЗначение));
			Если СтрокаОписанияРеквизита.Количество() > 0 Тогда
				СтрокаОписанияРеквизита = СтрокаОписанияРеквизита[0];
				СтрокиЗначений = Форма.Свойства_ЗначенияДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство",СтрокаОписанияРеквизита.Свойство));
				Для каждого СтрокаЗначения из СтрокиЗначений Цикл
					СтрокаЗначения.Видимость = Результат;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеЗависимогоРеквизита.УсловиеОбязательностиЗаполнения <> Неопределено Тогда
			Если Не ОписаниеЗависимогоРеквизита.ЗаполнятьОбязательно Тогда
				Продолжить;
			КонецЕсли;
			
			Параметры = Новый Структура;
			Параметры.Вставить("ЗначенияПараметров", ОписаниеЗависимогоРеквизита.УсловиеОбязательностиЗаполнения.ЗначенияПараметров);
			Параметры.Вставить("Форма", Форма);
			Параметры.Вставить("ОписаниеОбъекта", ОписаниеОбъекта);
			Результат = Вычислить(ОписаниеЗависимогоРеквизита.УсловиеОбязательностиЗаполнения.КодУсловия);
			
			СтрокаОписанияРеквизита = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизитаЗначение", ОписаниеЗависимогоРеквизита.ИмяРеквизитаЗначение));
			Если СтрокаОписанияРеквизита.Количество() > 0 Тогда
				СтрокаОписанияРеквизита = СтрокаОписанияРеквизита[0];
				СтрокиЗначений = Форма.Свойства_ЗначенияДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство",СтрокаОписанияРеквизита.Свойство));
				Для каждого СтрокаЗначения из СтрокиЗначений Цикл
					СтрокаЗначения.АвтоОтметкаНезаполненного = Результат;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


Процедура ДобавитьДопРеквизитСведение(Форма, НаборДопРеквизитовСведений, ТипЭлемента)
	
	Если торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("Редактирование", "Справочники", "НаборыДополнительныхРеквизитовИСведений")
		  И торо_ОбщегоНазначенияКлиентПовтИсп.ЕстьПраво("Добавление", "ПланыВидовХарактеристик", "ДополнительныеРеквизитыИСведения") Тогда
		  
		Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			
			ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
			|Добавление дополнительных свойств возможно только после записи элемента.
			|Записать элемент?'");
			
			ПараметрыОповещения =  Новый Структура("Форма, НаборДопРеквизитовСведений, ТипЭлемента", Форма, НаборДопРеквизитовСведений, ТипЭлемента);
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьДопРеквизитСведениеЗавершение", ЭтотОбъект, ПараметрыОповещения), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
			
		КонецЕсли;
		
		ДобавитьДопРеквизитСведениеФрагмент(Форма, НаборДопРеквизитовСведений, ТипЭлемента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДопРеквизитСведениеФрагмент(Форма, НаборДопРеквизитовСведений, Знач ТипЭлемента)
	
	Если НЕ ЗначениеЗаполнено(НаборДопРеквизитовСведений) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаборСвойств"             , НаборДопРеквизитовСведений);
	ПараметрыФормы.Вставить("ТекущийНаборСвойств"      , НаборДопРеквизитовСведений);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", ТипЭлемента <> "ДопРеквизит");
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта",
					ПараметрыФормы, Форма.Элементы["Свойства_ЗначенияДополнительныхРеквизитов"]);
	
КонецПроцедуры

Процедура ДобавитьДопРеквизитСведениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	НаборДопРеквизитовСведений = ДополнительныеПараметры.НаборДопРеквизитовСведений;
	ТипЭлемента = ДополнительныеПараметры.ТипЭлемента;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭлементЗаписан = Форма.Записать();
	Исключение
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(НСтр("ru = 'Исключение'"), "Предупреждение",ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если Не ЭлементЗаписан Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьДопРеквизитСведениеФрагмент(Форма, НаборДопРеквизитовСведений, ТипЭлемента);
	
КонецПроцедуры

#КонецОбласти
