
#Область ПрограммныйИнтерфейс

// Возвращает сообщение о конфликте вида занятости сотрудника.
//
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники - сотрудник.
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физ. лицо.
//  Организация - СправочникСсылка.Организации - организация.
//  ВидЗанятости - ПеречислениеСсылка.ВидыЗанятости - вид занятости.
//  ДатаПриема - Дата - дата приема.
//
// Возвращаемое значение:
//  Строка - текст сообщения о конфликте.
Функция СообщениеОКонфликтеВидаЗанятостиНовогоСотрудникаССуществующими(Сотрудник, ФизическоеЛицо, Организация, ВидЗанятости, ДатаПриема) Экспорт
	 Возврат СотрудникиФормы.СообщениеОКонфликтеВидаЗанятостиНовогоСотрудникаССуществующими(Сотрудник, ФизическоеЛицо, Организация, ВидЗанятости, ДатаПриема);
КонецФункции

// Возвращает вид занятости для сотрудника.
//
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники - сотрудник.
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физ. лицо.
//  Организация - СправочникСсылка.Организации - организация.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыЗанятости - вид занятости.
Функция ПолучитьВидЗанятостиДляНовогоСотрудника(Знач Сотрудник, Знач Организация, Знач ФизическоеЛицо = Неопределено) Экспорт
	Возврат СотрудникиФормы.ПолучитьВидЗанятостиДляНовогоСотрудника(Сотрудник, Организация, ФизическоеЛицо);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодобратьСписокФизЛиц(ФизическоеЛицоСсылка, Фамилия, Имя, Отчество) Экспорт
	Возврат СотрудникиФормы.ПодобратьСписокФизЛиц(ФизическоеЛицоСсылка, Фамилия, Имя, Отчество);
КонецФункции

Функция ЗаблокироватьФизическоеЛицоПриРедактированииНаСервере(ФизическоеЛицоСсылка, ФизическоеЛицоВерсияДанных, ФормаУникальныйИдентификатор) Экспорт
	Возврат СотрудникиФормы.ЗаблокироватьФизическоеЛицоПриРедактированииНаСервере(ФизическоеЛицоСсылка, ФизическоеЛицоВерсияДанных, ФормаУникальныйИдентификатор);
КонецФункции

Функция ПрочитатьДанныеСвязанныеССотрудником(Форма) Экспорт
	 Возврат СотрудникиФормы.ПрочитатьДанныеСвязанныеССотрудником(Форма);
КонецФункции
	
#КонецОбласти
