////////////////////////////////////////////////////////////////////////////////
// торо_НастройкаПорядкаЭлементовСлужебныйВызовСервера: методы, для работы с порядком элементов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ИзменитьПорядокЭлементов(СсылкаНаОбъект, РеквизитДопУпорядочивания, Направление, СтруктураИерархии, СтруктураСдвига, ЭлементДляОбмена = Неопределено) Экспорт
	
	Возврат торо_НастройкаПорядкаЭлементовСлужебный.ИзменитьПорядокЭлементов(
		СсылкаНаОбъект, РеквизитДопУпорядочивания, Направление, СтруктураИерархии, СтруктураСдвига, ЭлементДляОбмена);
	
КонецФункции

Процедура ПерезаполнитьПорядокЭлементовВИерархии(СтруктураИерархии) Экспорт
	
	ТаблицаИерархии = торо_РаботаСИерархией20.ПолучитьТаблицуИерархии(СтруктураИерархии);
	ТаблицаИерархии.Сортировать("РодительИерархии, ОбъектИерархии");
	
	СчётчикДопУпорядочивания = 1;
	
	НаборЗаписей = РегистрыСведений.торо_ПорядокОРПоИерархии.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СтруктураИерархии.Установить(СтруктураИерархии);
	
	Если СтруктураИерархии.СтроитсяАвтоматически Тогда
		
		Для Каждого СтрокаТаблицы Из ТаблицаИерархии Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.РодительИерархии) 
				И ТипЗнч(СтрокаТаблицы.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				
				НС = НаборЗаписей.Добавить();
				НС.ОбъектРемонта = СтрокаТаблицы.ОбъектИерархии;
				НС.СтруктураИерархии = СтруктураИерархии;
				НС.РеквизитДопУпорядочиванияОР = СчётчикДопУпорядочивания;
				
				СчётчикДопУпорядочивания = СчётчикДопУпорядочивания + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаТаблицы Из ТаблицаИерархии Цикл
			НС = НаборЗаписей.Добавить();
			НС.ОбъектРемонта = СтрокаТаблицы.ОбъектИерархии;
			НС.СтруктураИерархии = СтруктураИерархии;
			НС.РеквизитДопУпорядочиванияОР = СчётчикДопУпорядочивания;
			СчётчикДопУпорядочивания = СчётчикДопУпорядочивания + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

