#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		Если КоэффициентыПеревода.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'В документе не заполнена ни одна табличная часть. Проведение невозможно!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
	Иначе
		Если КоэффициентыПереводаСписковОбъектов.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'В документе не заполнена ни одна табличная часть. Проведение невозможно!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполненно значение поля ""Организация""!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		
		// регистр торо_КоэффициентыПереводаБазовыхЦенВТекущие
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущие.Записывать = Истина;
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущие.Очистить();
		
		Для Каждого ТекСтрокаКоэффициентыПеревода Из КоэффициентыПеревода Цикл
			Движение = Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущие.Добавить();
			Движение.Период = Дата;
			Движение.Организация = ТекСтрокаКоэффициентыПеревода.Организация;
			Движение.Подразделение = ТекСтрокаКоэффициентыПеревода.Подразделение;
			Движение.Направления = ТекСтрокаКоэффициентыПеревода.Направления;
			Движение.ОбъектРемонта = ТекСтрокаКоэффициентыПеревода.ОбъектРемонта;
			Движение.КлассификаторРемонтов = ТекСтрокаКоэффициентыПеревода.КлассификаторРемонтов;
			Движение.Коэффициент = ТекСтрокаКоэффициентыПеревода.Коэффициент;
			Движение.ПоказательКоэффициента = ТекСтрокаКоэффициентыПеревода.ПоказательКоэффициента;
		КонецЦикла;
	Иначе 
		
		// регистр торо_КоэффициентыПереводаБазовыхЦенВТекущие
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.Записывать = Истина;
		Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.Очистить();

		Для Каждого ТекСтрокаКоэффициентыПеревода Из КоэффициентыПереводаСписковОбъектов Цикл
			Движение = Движения.торо_КоэффициентыПереводаБазовыхЦенВТекущиеРегл.Добавить();
			Движение.Период = Дата;
			Движение.СписокОбъектов = ТекСтрокаКоэффициентыПеревода.СписокОбъектов;
			Движение.КлассификаторРемонтов = ТекСтрокаКоэффициентыПеревода.КлассификаторРемонтов;
			Движение.Коэффициент = ТекСтрокаКоэффициентыПеревода.Коэффициент;
			Движение.ПоказательКоэффициента = ТекСтрокаКоэффициентыПеревода.ПоказательКоэффициента;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#КонецЕсли