
#Область ОбработчикиСобытийЭлементовТаблицыФормыСправочникСписокПодразделений
&НаКлиенте
Процедура СправочникСписокПодразделенийПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.СправочникСписокПодразделений.ТекущиеДанные = Неопределено Тогда
		УстановитьОтборНаСервере(Элементы.СправочникСписокПодразделений.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьОтборНаСервере(Ссылка)
	
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
	ЭлементОтбора.ПравоеЗначение = Ссылка;
	ЭлементОтбора.Использование = Истина;
	// --если его надо сделать недоступным для пользователя
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры
#КонецОбласти