
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоПравамПользвателя();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоПравамПользвателя()
	
	СоответствиеЭлементов = Новый Соответствие;
	СоответствиеЭлементов.Вставить("ГруппаПричиныЗакрытияЗаявок", Метаданные.Справочники.торо_ПричиныЗакрытияЗаявок);
	СоответствиеЭлементов.Вставить("ГруппаПричиныЗакрытияРемонтов", Метаданные.Справочники.торо_ПричиныЗакрытияРемонтов);
	СоответствиеЭлементов.Вставить("ГруппаТипыКоэффициентовПереводаСтоимостейРемонтов", Метаданные.Справочники.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов);
	
	Для каждого КлючИЗначение из СоответствиеЭлементов Цикл
		Если НЕ ПравоДоступа("Просмотр", КлючИЗначение.Значение) И Элементы.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
			Элементы[КлючИЗначение.Ключ].Видимость = Ложь;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПричиныЗакрытияРемонтов(Команда)
	ОткрытьФорму("Справочник.торо_ПричиныЗакрытияРемонтов.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТипыКоэффициентовПереводаСтоимостейРемонта(Команда)
	ОткрытьФорму("Справочник.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПричиныЗакрытияЗаявок(Команда)
	ОткрытьФорму("Справочник.торо_ПричиныЗакрытияЗаявок.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

#КонецОбласти
