#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Информация = НСтр("ru = 'Загрузка исторических данных о фактических затратах на ОР'");
	ПараметрыРегистрации.Наименование = НСтр("ru = 'Загрузка исторических данных о фактических затратах на ОР'");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0.0";  
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Загрузка исторических данных о фактических затратах на ОР'");
	Команда.Идентификатор = "ЗагрузкаИсторическихДанныхОФактическихЗатратахНаОР";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;

КонецФункции  
	
#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#КонецОбласти 

#КонецЕсли
