#Область ПрограммныйИнтерфейс

// Позволяет изменить имя файла расшифровки расчета ППР перед его сохранением.
// Если ничего не делать, то будет использовано стандартное имя файла "Расшифровка расчета ППР <дата>".
//
// Параметры:
//		СсылкаНаППР - ДокументСсылка.торо_ПланГрафикРемонта - Документ, к которому прикрепляется файл.
//		ИмяФайла - Строка - Выходной параметр. Результирующее имя файла.
//
Процедура ПриФормированииИмениФайлаРасшифровки(Знач СсылкаНаППР, ИмяФайла) Экспорт
	
	
	
КонецПроцедуры

// Позволяет выполнить дополнительные действия с присоединенным файлом после его сохранения.
//
// Параметры:
//		ПрисоединенныйФайл - СправочникСсылка.торо_ПланГрафикРемонтаПрисоединенныеФайлы - файл расшифровки.
//
Процедура ПослеСохраненияФайлаРасшифровки(ПрисоединенныйФайл) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти