#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыВСпискахОР();
	УстановитьПараметрыВСпискахТиповых();
	
	ТКБезМатзатрат.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
	ТКБезТрудозатрат.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
	
	ФОТиповые = ПолучитьФункциональнуюОпцию("торо_ИспользоватьТиповыеОР");
	ФОЗапчасти = ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей");
	Элементы.СтраницаТиповыхОбъектовРемонта.Видимость = ФОТиповые;
	Элементы.ОРБезТиповых.Видимость = ФОТиповые;
	Элементы.ОРБезЗапчастей.Видимость = ФОЗапчасти;
	Элементы.ТОРБезЗапчастей.Видимость = ФОЗапчасти;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВкладкуОР(Команда)
	УстановитьПараметрыВСпискахОР();
	Элементы.ОРБезТиповых.Обновить();
	Элементы.ОРБезЗапчастей.Обновить();
	Элементы.ОРБезНормативных.Обновить();
	Элементы.ОРБезПредшествующих.Обновить();
	Элементы.ОРБезЗамещаемых.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВкладкуТиповых(Команда)
	УстановитьПараметрыВСпискахТиповых();	
	Элементы.ТОРБезОбъектовРемонта.Обновить();
	Элементы.ТОРБезЗапчастей.Обновить();
	Элементы.ТОРБезНормативных.Обновить();
	Элементы.ТОРБезПредшествующих.Обновить();
	Элементы.ТОРБезЗамещаемых.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВкладкуТК(Команда)
	Элементы.ТКБезТиповых.Обновить();
	Элементы.ТКБезОбъектовРемонта.Обновить();	
	Элементы.ТКБезМатзатрат.Обновить();
	Элементы.ТКБезТрудозатрат.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОРПриИзменении(Элемент)
	УстановитьПараметрыВСпискахОР();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТиповойПриИзменении(Элемент)
	УстановитьПараметрыВСпискахТиповых();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаОбъектовРемонта Тогда
		УстановитьПараметрыВСпискахОР();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаТиповыхОбъектовРемонта Тогда
		УстановитьПараметрыВСпискахТиповых();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлемента(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВСпискахОР()
	
	ОРБезТиповых.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ЗначениеЗаполнено(ОтборОрганизация));
	ОРБезТиповых.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделению", ЗначениеЗаполнено(ОтборПодразделение));
	ОРБезТиповых.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ОРБезТиповых.Параметры.УстановитьЗначениеПараметра("Организация", ОтборОрганизация);
	ОРБезТиповых.Параметры.УстановитьЗначениеПараметра("Подразделение", ОтборПодразделение);
	ОРБезТиповых.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);	
	
	ОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ЗначениеЗаполнено(ОтборОрганизация));
	ОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделению", ЗначениеЗаполнено(ОтборПодразделение));
	ОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("Организация", ОтборОрганизация);
	ОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("Подразделение", ОтборПодразделение);
	ОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);	
	
	ОРБезНормативных.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ЗначениеЗаполнено(ОтборОрганизация));
	ОРБезНормативных.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделению", ЗначениеЗаполнено(ОтборПодразделение));
	ОРБезНормативных.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ОРБезНормативных.Параметры.УстановитьЗначениеПараметра("Организация", ОтборОрганизация);
	ОРБезНормативных.Параметры.УстановитьЗначениеПараметра("Подразделение", ОтборПодразделение);
	ОРБезНормативных.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);	
	
	ОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ЗначениеЗаполнено(ОтборОрганизация));
	ОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделению", ЗначениеЗаполнено(ОтборПодразделение));
	ОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("Организация", ОтборОрганизация);
	ОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("Подразделение", ОтборПодразделение);
	ОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);	
	
	ОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("ОтборПоОрганизации", ЗначениеЗаполнено(ОтборОрганизация));
	ОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделению", ЗначениеЗаполнено(ОтборПодразделение));
	ОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("Организация", ОтборОрганизация);
	ОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("Подразделение", ОтборПодразделение);
	ОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);	

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВСпискахТиповых()
	
	ТОРБезОбъектовРемонта.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ТОРБезОбъектовРемонта.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);
	
	ТОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ТОРБезЗапчастей.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);
	
	ТОРБезНормативных.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ТОРБезНормативных.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);

	ТОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ТОРБезПредшествующих.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);
	
	ТОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("ОтборПоНаправлению", ЗначениеЗаполнено(ОтборНаправление));
	ТОРБезЗамещаемых.Параметры.УстановитьЗначениеПараметра("Направление", ОтборНаправление);
	
КонецПроцедуры

#КонецОбласти