#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.ОбъектРемонта.Значение) 
		И ТипЗнч(ЭтотОбъект.Отбор.ОбъектРемонта.Значение) = Тип("СправочникСсылка.торо_ОбъектыРемонта") 
		И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("НеОбновлятьРегистрНаличиеНормативов") Тогда
		торо_РаботаСНормативамиСервер.ОбновитьСвойствоОР_ЕстьПараметрыНаработки(ЭтотОбъект.Отбор.ОбъектРемонта.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
