////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ОбменТОиР30ЕРП20_ЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменТОИР30ЕРП20", Источник, Отказ);
КонецПроцедуры

Процедура ОбменТОиР30ЕРП20_ЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменТОИР30ЕРП20", Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ОбменТОиР30ЕРП20_ЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменТОИР30ЕРП20", Источник, Отказ,Замещение);
КонецПроцедуры

Процедура ОбменТОиР30ЕРП20_ЗарегистрироватьУдалениеДокументаПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменТОИР30ЕРП20", Источник, Отказ);
КонецПроцедуры

#КонецОбласти
