
#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзменениеДляRCMПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменТОИР20RCM", Источник, Отказ);
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеДокументаДляRCMПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменТОИР20RCM", Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ЗарегистрироватьУдалениеДляRCM(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменТОИР20RCM", Источник, Отказ);
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеНабораДляRCMПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменТОИР20RCM", Источник, Отказ, Замещение);
КонецПроцедуры

#КонецОбласти