#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	// 	Никакие настройки не требуются			
КонецПроцедуры
	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ЗначениеКонстанты = Константы.торо_ПериодРасчетаСтатистикиПотребления.Получить();
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодВыполнения");
	ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
	
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ПараметрПользовательскойНастройки <> Неопределено И ПараметрПользовательскойНастройки.Использование Тогда
			ПараметрНачалоПериода = ПараметрПользовательскойНастройки.Значение.ДатаНачала;
			ПараметрКонецПериода  = ПараметрПользовательскойНастройки.Значение.ДатаОкончания;
			
			Параметры.УстановитьЗначениеПараметра("ДатаНачала",НачалоМесяца(ПараметрНачалоПериода));
			Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецМесяца(ПараметрКонецПериода));
			//Параметры.УстановитьЗначениеПараметра("КонецПериода",КонецМесяца(ПараметрКонецПериода));
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли